{
  "Laeka": {
    "file": "Laeka _ Reforge.docx",
    "text": "General best ways we can work together Not a ton of stuff my end going to EDU Scale plan -  Cross-Selling Does it come up? Are there opportunities? Bucket 1 Renewals Teeing up some hand offs there Between us, who owns it on the Insights side Slow trickle Clay / GTM Engineering Learning ecosystem Drive Insights demand Demand Quarterly Dinners Boston New York LA - October Renewals Enterprises at 60%",
    "full_length": 400
  },
  "Litmos": {
    "file": "Litmos _ Reforge.docx",
    "text": "Meeting Notes Sid Kumar - Databricks Litmos Work for PE firm Fransisco Partners Operating partner Some PE firms - two sides - one is investment side - buying companies CRO atlassian Freshworks CEO at Litmos Diagnostic  - concerns she has there CEO - hiring a CEO to backfill Remain on board Fintech Data Projects Litmos Also hiring a SVP of GTM Ops at Litmos VP of Sales Ops Not as good as their most entry level ops guys at HubSpot Roadblocks / hindrances Everyones on Salesforce Power I She has to backfill herself in her operating partner role 75 companies Acute need Sales ops Barey knows how to use Salesforce Implement Gong Outreach -  Next Steps They are implementing Gong Tons of data issues with Salesforce Curious to set strategy once they’ve cleaned up data issues Work on data strategy doc after audit",
    "full_length": 813
  },
  "Carousell": {
    "file": "Carousell _ Reforge.docx",
    "text": "Keith Oh | Head of Product Design Current State Intro Team Structure Process Aggregate Variety of tools/methods User testing - can be 1 day, 1 week, 6 months etc Couple colleagues - Finance, HR Exploratory projects - discovery - talk to users Face to face interviews Surveys via SurveyMonkey + Google Forms Analyze  Act Volume Seasonal During annual planning (2nd half of year) Different stakeholders need different info to put into plan Regional research This month - 2 surveys 3,000 responses each Series of interviews with pro sellers on their platform - 60 people Annual number 100 face to face interviews Keep transcripts Google Drive Surveys 7-8 big ones 40,000 responses a year Tickets CX team runs that analysis every week - gives them a report Hundreds Business Impact Focus on Southeast Asia Ebay of that part of the world Talk to users Business team as well Understand client pain points Budget planning season coming up",
    "full_length": 931
  },
  "Elissa Bordner": {
    "file": "Elissa Bordner _ Reforge.docx",
    "text": "Elissa  Bordner.com PM consultant, leverage Insights for her clients",
    "full_length": 68
  },
  "Marketing": {
    "file": "Marketing _ Reforge.docx",
    "text": "Case studies Presentation materials Pilot deck Onboarding Deck Email campaigns? Awareness campaigns? LinkedIn Ads Target Account plays Next Trial onboarding directions",
    "full_length": 167
  },
  "SkillAxis": {
    "file": "SkillAxis _ Reforge.docx",
    "text": "Tab 1 Job platform for PMs Education for PMs Coaching business too Sell some of the coaching leads Nabeel was at Amazon for a while Couple months ago Customer Feedback Early in product journey Learning platform - launching it - host videos created by Nabeel - product skills - some is interview based content Understand Where people are dropping off Next Steps Couple of sharp guys starting a consulting company with e-learning They were interested in Insights – cost prohibitive They will reach back if interested in trial for Research + IA",
    "full_length": 541
  },
  "Nationwide": {
    "file": "Nationwide _ Reforge.docx",
    "text": "Person Team Size Business Timing Urgency Customer Voice Strategy + Impact —---------------------------------------------------------------------------------------------------------------------------- Aggregate How much? Channels? Analyze Act —----------------------------------------------------------------------------------------------------------------------------",
    "full_length": 367
  },
  "Zeffy": {
    "file": "Zeffy _ Reforge.docx",
    "text": "Rough Notes Company Website Current strategy process to go from insights to action? Collecting insights How much? Analyzing them How? CS starts this AI tags ticket Look at most common tags Exports all tickets - runs them through GPT - lots of manual work - notion down for the issue - send them to product Product team - it depends, they have other targets Look at conversion rates - opening an account / closing  Don’t always use support tickets Business Impact Don’t have any big satisfaction issues NPS is super high Most important: Deflection What could they change in the product to prevent people to not open a ticket User has to go from  Actioning them Current vs. future state? Biggest challenges today: What are you hoping to use Insights for? Roadmap? Eng ticket? Prototype? Prioritization? Prd? Closing feedback loop? SendtoSend Was referred to this tool by friend of hers Zeffy Different entry points for user feedback Tickets (HubSpot Help Desk + Forethought (AI Agent)) Public review sites (G2, Capterra, Google Reviews) NPS + CSAT (HS) Canny (Feature request platform) User interviews (Great Question) - lowest volume - transcribed calls Volume / Month 10,000 conversations a month Tickets treated by humans - 5,000 Analyze that in siloes AI tool that gathers all data Goal for her: useful for her team as it is for the product teams Business Impact Timing Was not initially on plans for the fall Shopping mode for now Very AI forward Save manual work Head of Product is very interested in that type of tool 2 month cycle IMPORTANT Grouping of the topics AI tool they use now for support - already giving them the conversation topics How is the AI understanding the snippets Putting them together as themes How granular can it get - team already tags the tickets (refund vs. what) Amongst refunds, what are main issues Is it too long, or can they not find out how to get a refund Quoting 16-17,000 data points / month CSAT Is it free text? 20,000 / month x .12 - $2,400/month $25,000 a year $20-25k/year Onboarding costs 3 months of their volume 20k x 3 = 60k Multiply by .04 = $3,000 onboarding —---------------------------------------------------------------------------------------------------------------------------- Pricing Structure 20-25k Double growth every year —---------------------------------------------------------------------------------------------------------------------------- Total number of customer feedback / month? 10k conversations from Forethought  - will have to run an export / import Zapier integration 5k tickets from Hubspot  4.5k survey responses in Hubspot (CSAT and NPS)  Maybe 30-50 reviews on G2, Trustpilot and Google  70 feature requests on Canny Total historical data to analyze? I'd probably go back the past 2 months only since the product evolves super quickly. So 2x the above volume.  Does your Amplitude integration allow for pushing data from Amplitude surveys? We might also add those.  HubSpot integration Push tickets but also survey ",
    "full_length": 6441
  },
  "Annuities Genius": {
    "file": "Annuities Genius _ Reforge.docx",
    "text": "Tab 1 Outsourcing user interviews to another company Doing it manually  Who are you trying to collect feedback from? Interviews are for a different project People who are going to retire soon Consider buying them For AG - also interesting Annuities sales agents, carriers PostHog for AG - NPS survey Volume of feedback For october - 10 NPS responses Every 3 months Sales calls HelpScout - support tickets Apollo - calls  PostHog - NPS - surveys Aggregates but doesnt surface any insights Next Step Shes interested in IA > but has to sell her boss on it Research very interested, starting trial She’s going to get me a few upload files for the trial, and I’ll get them uploaded",
    "full_length": 676
  },
  "TaskRay": {
    "file": "TaskRay _ Reforge.docx",
    "text": "Tab 1 Salesforce native app Extension Focus on PM Speciality - post-sale delivery Onboarding Implementations Repeatable delivery process Biggest problems right now: Customer-facing teams are bogged down - don’t really get that entered Dont have a good pulse on whats happening with customer-facing convos Scrape those calls - feedback, themes Less than 50 people - not incredibly high volume Her role Product team 4 people - 2 PMs, 2 Designers Process today Occasionally customer facing teams will input stuff Productboard today for roadmap Quarterly webinars - people can vote for things they are most excited about Surveying tools Customer interviews Starting to set up some discovery stuff currently Implementing a digital adoption platform Sources Productboard feedback + upvoting NPS Optimal Workshop - any type of survey - stack ranking, open text, multiple choice Calls CSM enters feedback Reforge She’d heard of us on Lennys podcast Educational side AI prototyping tool Reforge - existing apps Volume Calls | 20-30 hours a month across organizations 200 tickets a month | productboard - 20-30 / mo Surveys - release roughly every 8 weeks 4-5 weeks  IN APP MICROSURVEYS One challenge Get a lot of information about vibes Can’t quantify the sentiment Chorus Slack ZenDesk HubSpot Asking about this: From snippets, get back to original source? Call imported Can the actual link to the transcription be surfaced? Watch the video - support ticket - go to the actual ticket Is a link available BuildBetter Place to store customer data / customer calls Product feedback/information Other teams They can use it to analyze their calls, how they are navigating conversations Sales - objection handling Use Case Uploaded interviews What themes did they identify Gaps - nothing so far Direct link to the source - BB snippets - also has the video Pricing Sameballpark - no minimum What have you seen from them? Trial - POC Next Steps Racheal is in Slack pilot Get testing done, pricing over to her, close quick",
    "full_length": 2005
  },
  "Zerra HQ": {
    "file": "Zerra HQ _ Reforge.docx",
    "text": "Daniele | Zerra HQ Building a new product Relocate to different countries NEED: -Improve how they run research -Have many hypothesis -Hard to get in front of clients Validate User Testing Insight Better at getting in front of users B2C Individual relocators Digital nomads Lifestyle workers Remote workers Client base Country as a subscription Visa Accounting 20 clients / members Operating in 3 countries Building a AI tool to help people relocate How do you do this today? Not very good at it Need to have a call with potential clients Calls could be any kind of leads More than 150 calls so far How many users How much feedback Interested in insights and courses Not really testing the tech Today | Feedback on the services",
    "full_length": 726
  },
  "Evergive": {
    "file": "Evergive _ Reforge.docx",
    "text": "Ishmael - CEO EverGive - 12.5% return on donations for nonprofits PDE team -  Context- AI- Discovery Process Breakage",
    "full_length": 117
  },
  "Arist": {
    "file": "Arist _ Reforge.docx",
    "text": "Tab 1 Build courses with AI in real-time Learner engagement/completion data L&D admin experience with platform tools Content effectiveness feedback Integration issues (SMS delivery, LMS connections) AI content generation quality feedback Notes Lead Source:  Inbound Build signup Context Setting - tell me a bit about your business Biz Model Enablement at scale Create micro courses with AI Their role + team structure PM Their AI maturity level Engineers are using it CPO is pretty advanced His background is in User Research - they are a Enterprise focused company - 20 or so active customers Insights are word of mouth through that process Process - walk me through your current discovery process Listening for: manual, fragmented, limited resources, multiple products If something is worth elevating to product, tag via Linear Not super scalable - trying to scale usage across existing customers and get new customers AI-moderated interviews, interested in that use case Don’t have time to do a bunch of discovery calls Prototyping - doing the occasional V0 (his tool) - take a screenshot, paste it in, start with this page - add these three things - use this with an engineer in a ticket Started playing around with Cursor more - that exact use case - looks what this page looks like, this version looks like Design system - custom components - if it could use what they already have How do you make the call on what to build? Its a sales driven org, they kinda know what they need down the line Roadmap goes much further than this year - more of a prioritization / scoping - know they need to do x, strong vision from founders - we can do this, but it’ll take a long time, bottoms up few customers mentioned this is kinda confusing Roadmap items they know they want to do for the year: Need to make it easier – need input from customers before they go down that path Enterprise level permissioning Consequences - what happens if you don't validate? Listening for: speed, time cost, adoption/retention/churn, modernization challenges, bias, making wrong decision Solution - whats your plan to fix this? Timing, Budget, Internal stakeholders Poking around to see whats available - his manager used V0 to build a separate product - sold it and demod it - folding it into their main app and rebuilding it How old is it? Before Covid - pre 2019 25 people Same product for a long time - creating content, sending content over messaging channels - Teams/Slack/SMS Close Build - $50/month per person - $600 annual per user - 5 seat minimum = $3,000 / year 10k credits Research - $50/month for 300 minutes - $600 annual per user $1,200 total annual Insights - $6,000 annual Build - $3,000 annual Research - $1,000 annual Total: $10,000 annual Next Steps Better fit for Build + Research Look into his Build account",
    "full_length": 2809
  },
  "Chalice": {
    "file": "Chalice _ Reforge.docx",
    "text": "Tab 1 Currently collecting feedback? Gong Emails CS, Sales Volume of feedback 10 calls a day recorded Analyzing Not doing that today Client Tracks Pitches Surveys - not doing that yet Gong Gong dagta – controls - certain types of calls Some of it is privacy based Closed environment Use Claude Claude is linked to ecosystems Security Docs Best practices - roadmap development for our products Best Practices Pilot call What are you trying to accomplish? Send me import files Haven’t linked to any internal systems One of their customers - Bayer - did a interview - loaded that up Radio button - include it in their profile or one-off Sources Gong Chris - support tickets - HubSpot After a opportunity closes - need to create tickets in JIRA Email exchanges Hubspot - Sales/Marketing/Campaigns JIRA ticket Slack They use Claude They want to hook up the Gong MCP Sample data for Gong Sample data for CSV tickets Monthly basis Tickets |  Emails |  Calls | 3 sales reps - 2-3 a day | 40 calls a week Quoted him $15k for 30,000 data points / year 2500 / month 1600 for Gong calls Email tickets? GitHub - dont use it for ticketing JIRA Snowflake today: Using it for BI of model data Grab their customer data via Snowflake data share Snowflake marketplace",
    "full_length": 1248
  },
  "Klook": {
    "file": "Klook _ Reforge.docx",
    "text": "Haniko Tio Issues they currently face Product launches Never been easier - with AI - come up with variations of a product design Able to do a bit more - micro designs Idea now Micro design - A/B testing Lackluster method for them to qualitatively see if its good or bad Quantitative - CPR, click rate, etc Hear about the customers emotions How do they scale more qualitative interviews Doing a very simple usability interviews Test a, Test b Your sentiment when you are doing this This process can catch up with the speed of how many pages they are able to do micro design tweaks Multi language support Smart dashboard - how many tests - how many customers That is 1 Klook Application Channels for feedback Reddit Google Play Use a mix of tools HootSuite SEMRush Mixture of social media listening  Bring this and recording back Demo based on their actual case Mockup case - this is the scenarios",
    "full_length": 895
  },
  "Fox": {
    "file": "Fox _ Reforge.docx",
    "text": "Tab 1 Nathan  Context Product role with all Fox owned local stations They own 17 of them He’s product manager supporting those In the last year His role: Growth focused Bit different approach 17 websites that correlate – moving towards connected experience Mobile app - same thing Future of their audience – secular decline of broadcast tv Shift those viewers into a digital experience Long time Reforge education fan - will re up for that model this year Brian is someone he follows on Twitter - pretty active user of Lovable Thesis: Start with a mature version of their product Plug in logo, branding, references with us - get stuff that looked pretty close to what we have Pre-Prototyping: 1 big challenge Cut to: Primary product is this new CTV experience Pretty closed ecosystem – typically pretty strong continuity between mobile / web Take someone to app store through banner etc Can’t really send people direct to CTV from web links / mobile links - you can suggest them to go Can do in-app push - BUT can’t push through home screen GOALS: Acquisition / engagement / retention Spending a lot of money on ads Very competitive Very niche - local news Process DAILY ACTIVE USERS Orienting: create more habit with users in CTV - get those numbers up - strengthen retention Some segment of audience disappears for a while When they have them - how do they keep them Prototyping He leads the charge Opportunities to remind people that they have this livestream that we know they like - video assets that outperform other publishers How much does customer intelligence Some tools can promise to parse data sets App reviews - thousands - they have direct inbox feedback - tens of thousands Keyword searches for key things - CTV specific app, FireTV, Apple TV, Visio - see if that unearths something Started a survey process People who email - construct a list of 50-100 - learn more from them Send that out once a month Corporate compliance Want to have direct conversations with people - find a way to ask people to have a discussion Inbox, Reviews, Survey responses Constructing that against: ‘will it move the needle’, ‘will it increase satisfaction to improve metrics’ Nothing sophisticated that they’ve used Bundle up emails, put that into Gemini, ChatGPT - help me make sense of that Identify the themes Mobile vs. CTV Output False data - make up users, feedback that’s not real GPT is very honest Gemini  Who is the economic buyer? Who is the decision maker? Value of Prototyping Prototyping Process Post-Prototype Workflow Tools & Preferences Documentation Fragmentation Fox local group Independent business unit Licenses Himself and a PM on their team Manager sounded interested Insights Estimation Share with him Easily digestible on a executive level See what you’re asking for Value Bundled costs were Breakout costs for each of those things His management Learn more about this What to ask for? Confirm that they have a warehouse - all data lives in there (tables, scheme - all lives in ",
    "full_length": 7349
  },
  "RapidMail": {
    "file": "RapidMail _ Reforge.docx",
    "text": "Thomas Context They’ve been struggling to get customer interviews They dont seem to be very responsive to get feedback 17-22k active customers Small Team 1 person in UX, 2 product managers Limited resources Questions after a NPS survey Trying to set up a user group Feedback collection process NPS survey - every 90 days - existing clients Ratings - TrustPilot, OMR in Germany Some channels Product calendar link Customer interview Technical difficulties Working with product Heavy users of feedback functionality Support, interviews, or those channels Connect this to problem areas Initatives Opinionx - survey tool better than Google Forms After NPS - see what response would be to AI interviewer Budget conversations wrapping up ProdPad - not up until October",
    "full_length": 762
  },
  "Comfy": {
    "file": "Comfy _ Reforge.docx",
    "text": "Context Business Overview ComfyUI - free open source software to help people generate audio, video, images, 3D models ComfyUI - Cloud - usage based pricing Enterprise - for teams - design studios, production houses ComfyUI Open Source Users: Individual artists, designers, filmmakers Researchers and academics Hobbyists and enthusiasts Developers building custom solutions Volume:  Millions of users Revenue:  $0 direct (community value) Comfy Cloud Users: Individual creators who want ease of use Small teams without GPU infrastructure Content creators needing quick turnaround Volume:  Unknown (likely thousands to tens of thousands) Revenue:  Per-usage fees Comfy Cloud Enterprise Customers: Design studios (mentioned on site) Production houses (mentioned on site) VFX companies Known enterprise users: Netflix, Amazon Studios, Ubisoft, EA, Tencent, OpenAI Volume:  Likely 10-100+ enterprise accounts Revenue:  Highest margin, custom contracts Stack ZenDesk MixPanel GitHub Discord Slack Twitter Reddit Group chats Business Challenges: Large scale analysis on this data set Process today Vector DB Use Notion for task tracking Tries to categorize it into a task Dont ingest Discord, Reddit, emails, missing info Top level metrics from mixpanel Volume 40,000 user discord group Subreddit has 100k members GitHub - tons of new ones 1 million points a month The challenge we hear from companies like yours: Individual creators flood Discord with feature requests (loud signal) Enterprise customers mention critical issues in Zendesk tickets (quiet signal) GitHub issues show technical bugs but lack business context Mixpanel shows WHAT users do, but not WHY they're struggling Result? Product teams spend hours manually piecing together insights, and critical enterprise feedback gets missed in the noise. What is the time cost of your current state? Evaluation Process Get a trial started immediately Trial Setup Call Monday —  Use Case 1. Feature-Specific Analysis: \"Let's say we've launched a specific feature. Are we able to parse through all the ingested feedback for that specific feature?\" 2. Persona Definition & Segmentation: \"Can we define personas and have people get tagged or feedback get tagged under a specific persona?\" They need to differentiate between: Individual creators (free tier, high volume) Enterprise customers (low volume, high value) Developers (ecosystem contributors) Different user types within each segment 3. Customization & Control: \"Questions around customization... What if we don't agree with the AI triaged tag? Is there ways we can improve the system?\" Products COMFY ORG PRODUCT PORTFOLIO 1. ComfyUI (Open Source - FREE) Type:  Free, open-source software Description:  Node-based AI workflow engine for generating video, images, 3D, and audio Distribution:  GitHub, runs locally on user's machine Business Model:  Free forever (community edition) Target Users:  Individual creators, developers, hobbyists, researchers Key Features: Visual node-based workflow ",
    "full_length": 11399
  },
  "Little Spoon": {
    "file": "Little Spoon _ Reforge.docx",
    "text": "Idea of bringing prototyping into their workflow Earlier read on what may work, vs. what may not Previously Doing that a bit - taking a eng first approach Lot of use cases to use LLMs to develop features Devin - model trainer on their code base - integrated to GitHub Integration plan for feature - build prototype on view app Lots of trial and error AI isnt super great at writing passable code Integrate a AI prototyping tool Process pre-prototype Been using Build - built a few prototypes - sending to team Feedback / Intuition Typical flow They conduct a bunch of research Synthesize it into a user research study Synthesize that study into a series of actions they want to take on the product Real example B2C sub business Assessing profitability of certain quartiles of customers 200% of profit comes from 25% of customers Losing money on the other 75% One thing they all have in common —-- acquire them when they have a kid who is less than 1 5 main products As they grow > adding customers to each product Blends / Biteables customers have best LTV Ultimately drive all that profit Recently Digging into that - happen to be ideal member of the Little Spoon tribe - they buy into their values - they get it More interested in homemade / high quality food - good nutritional value BUT - advertising - convenience OK - maybe acquire less customers if they focus on homemade quality / transparency of ingredients BUT -  Took that brief - tried to build a prototype with Build Did a ‘pretty good job’ Questions / Concerns MAIN THING As hes trying to use this to inspire designers to build something Getting hung up The ones he’s been able to build look nothing like his website Installed the chrome extension - can build on top of that and make changes Feedback: He wished there was a way for it to capture – page that hes screenshotting for it to still be interactive – not always able to grab that Seems like there is a way to integrate their design system - love for there to be a way to upload his design system from Figma - these are our brand guidelines Prototype looks and feels more like Little Spoon Fits into website Looks and feels like Little Spoon What do you do with these? PM can build to explain or explore a idea before building out requirements Team Cross-functional team of PMs, Design 22 people Timing Interested in the Insights side of it Spend some separate time with that 5-6 people on his team who would love to use this Interested in trying this out with more of the team Couldnt quite understand pricing Started with free version - 2,000 credits He did upgrade to paid version - 10,000 credits - Friday night - built 1 since then - down to 7900 Head of Consumer Insights Using a tool called Marvin Integrating any interview - not as far as any care conversation Repository of research with AI -  Credits IF credits will continue to work this way Before you go to build something - estimate of how many credits you’re going to use Figma https://build.reforge.com/share/jiR",
    "full_length": 3103
  },
  "Groupr5": {
    "file": "Groupr5 _ Reforge.docx",
    "text": "Tab 1 IA - booked with Chun Working with Insights tool Intercom Trust Pilot Couldn’t connect that Email  Send a lot of campaigns Many people reply to that Wants to centralize everything in Reforge Clevertao App Store Apple / Google Pay Calls Sometimes they do research with research team Right now Launching new changes in their products Last month Added a new fee Generating a snowball in their customers - complaining What are they saying? Make a better storytelling for that fee In other products they have To know what they are saying Process today: Analyzing in siloes Made a script in Google to search all emails and give him a weekly summary of that In Intercom - service team talks to them and tells them - only way they know Its so reactive > need to be more proactive Annual Volume Number Trustpilot | 200/month Intercom |  Email | 200/month App Store | 100/month Reforge Gmail Customer Data Use HubSpot - don’t collect data from customers in HubSpot How do you rank your customers in terms of value? 4 products Obligatory insurance (SOAT) Annual safety check App - buy the SOAT or ASC in app New one: Book courses if they receive a traffic ticket Depends how many products someone has with them = value Most are annual products - SOAT - every year Fines Data Metabase Next How to change interviewer in Spanish Process Als have a monthly subscription He wants to try first Insights and Research $850/month First Insights to show the voice of the customer Improve with Research Monthly package Won’t approve a annual fee Timing to get started Depend on the price $880/month for Insights and Research Feedback volume to 1,000/month Integrate all sources Next Steps Keen to get going Need to get him monthly billing Insights + Research Integration information",
    "full_length": 1766
  },
  "Office Timeline": {
    "file": "Office Timeline _ Reforge.docx",
    "text": "HubSpot Insights lead Aaron White Jonathan Stumbles - Support  Focused on VOC work CS team uses Front Also have bugs through JIRA Data in Amplitude Customer data in HubSpot Aaron Been following Reforge for a while PowerPoint Contractng tools Working on two new products Excel PM tooling Growing quite a bit trough new products & M&A PMs - Insights across platforms Have to sift through variety of sources Front: PMs - visibility into top issues - this is manual Jonathan distills that down - no self serve option AppSea Tool they use - relationship for a while Tina She built a VOC program - home grown Connecting things through Zapier VOC database Front has some AI information - using that to say ‘look at emails that come in - are these feedback? Tag them’ – if it has a tag > triggers ZAP (categorize it - major customer / minor - feature / bug) > stores it in Notion as a record – end of month, large db of records >>> run that through AI >> tell us insights Scale As they grow - add more products What if they are missing emails? Better numbers/metrics Volume of feedback Front |  People can write into support People can write into feedback 80 emails a day | 1800-2200 emails a month Calls | generally don’t have any support calls, have support calls if they are having a tough time 5 a week max Product also wants customer calls for interviews - tell us more about the challenges / installation process Heavy time right now Jonathan - doesnt have a ton of time VOC database Strip out emails Clean DB - go analyze it Next up: Sell Research Test it Regroup closer to October renewal date",
    "full_length": 1593
  },
  "Enterprise DB": {
    "file": "Enterprise DB _ Reforge.docx",
    "text": "Use JPD for research tools Transitioning to JPD premium Looking for something to add Roll out for March Talking to two other product discovery tools JPD Roadmapping Doing pretty much everything Were using Monday SFDC & Jira integrations were lacking Atlassian ecosystem Its fine for roadmapping, feature, public roadmap PMs have to go tpe up a insight and tie it to a specific feature request They have PMs - tons of data Call data, support ticket, transcripts, slacks Co-mingled product set PMs for one product Volume of feedback per month 1,000/mo Can assign weights Customer tagging is manual How did they hear about us: LinkedIn ads Salesforce Zendesk - tickets Tableau Zoom transcripts Google doc Integration Ideal world Scanning through JPD items as data points Able to say heres your JPD item, heres the other snippets that might connect JPD is all the roadmap features and feature candidates Prioritizing 20 ideas they want Can they connect snippets / data across all 20 of those Within JPD tagging customers JPD has no product discovery",
    "full_length": 1045
  },
  "Samsara": {
    "file": "Samsara _ Reforge.docx",
    "text": "Tab 1 Build Notes Quick recap of what she like liked: Plan/Ask mode for early discovery structuring, high-quality clickable prototypes. Also nice that up-front work which produces better outputs can help reduce credit cost. In the next few weeks we'll be leaning HARD into plan mode, making that a primary means for interacting with the product. Team/credit model (pooled credits, editor/viewer roles, predictable usage) We're going to be set up for this with teams launch Easy capture of feedback (i.e. commenting pinned to elements of the prototype) Improvements planned but TBD on timing What she wanted: Some form of component/design-system capability This is still TBD - we're evaluating this for an extension feature Additional lightweight heuristic evaluation of early prototypes. Planned for plan mode improvements Possibility for prototypes that can be handed to another coding agent later. (e.g exporting structured specs/context for engineers or their coding agents.) This is in planning mode - we are working on handoff capability sometime in Q1 Possibility of exporting to Figma for production design. This is lower priority but we are looking at different integrations",
    "full_length": 1182
  },
  "Precisely": {
    "file": "Precisely _ Reforge.docx",
    "text": "Kaylee Andrews Chief of Staff Support their CPO Have about 30 PMs they want to put into various courses Talking with Product School - PMs already have certs there Likes what they have to offer - talk to competitors AI specifically Directors + through some Reforge training Company Precisely 1-5,000 EE LinkedIn As a global leader in data integrity, Precisely ensures that your data is accurate, consistent, and contextual. Our portfolio, including the Precisely Data Integrity Suite, helps integrate your data, improve data quality, govern data usage, geocode and analyze location data, and enrich it with complementary datasets for confident business decisions. Over 12,000 organizations in more than 100 countries, including 95 of the Fortune 100, trust Precisely software, data, and strategy services to power AI, automation, and analytics initiatives. Learn more at www.precisely.com. Prototyping Process Other tools? URGENCY!!!!",
    "full_length": 933
  },
  "Assembly": {
    "file": "Assembly _ Reforge.docx",
    "text": "David Boum Give customers a branded portal Build signup He’s been tasked to improve their user interview process Context Setting - tell me a bit about your business Biz Model Around for 5 years Target any service business - accountants, marketing agencies, consulting agencies - want a client portal, message them, pay them, file them, CRM, etc Got a million tools to do that - manage on backend - branded - good looking portal Their role + team structure Their AI maturity level Engineering side - Cursor and Claude Code to build out the product - PMs like Vercel - hes using Magic Patterns All heavily use AI - Claude and ChatGPT Pro subscription Process - walk me through your current discovery process Listening for: manual, fragmented, limited resources, multiple products -Doing a big AI project now - want to improve interview process -Don’t have time to do that - they find that they deprioritize that - looking for tools to automate that process - share it within team Customer voice Support - respond with a link to Calendly - depending on time they can set up interviews with product team Discourse - engaging with users there Previous roles - User Research team - big new feature is coming out - have a way to segment those users - its a bit more chaotic Consequences - what happens if you don't validate? Listening for: speed, time cost, adoption/retention/churn, modernization challenges, bias, making wrong decision Solution - whats your plan to fix this? Timing, Budget, Internal stakeholders Next Steps Wait on trial - fully dedicate to setting up time",
    "full_length": 1569
  },
  "GRESB": {
    "file": "GRESB _ Reforge.docx",
    "text": "Antoine  Works in the product team More efficient way to aggregate, manage prioritize user feedback / insights Human time Better visibility Alexandre Works in member success Client facing Collecting info - product is specific and technical Get a lot of information through qualitative Hard to get proper actionable intel Front for customer Hiccup Relied on the good will of colleagues - fill out a form - creates a task - Alex processes it with the product team Volume Cyclical biz model April - July Thousands of questions Antione Meet with Alex weekly Go through new feedback If its because of a bug - act quickly Improvement - not a defect or glitch - more of a annual cycle Annual - GRESB is a reporting platform - ESG performance - once a year using ther survey - explore their data Moving towards a more available product Submit assessment in July - thousand pieces of feedback in July Another thousand for looking at it after Prioritize what they can build based on next milestone – reporting experience is poor  Their Cycle July everyone comes in Prioritize improvements they may immediately benefit from Delay in the response Small team for eng capabilities Ask for a lot of feedback > don’t act on it— IMPRESSION Asked you before >> you didn’t do anything Product leads - get feedback all the time - groom it when its meaningful July is when they click submit May/June is when it kicks off July close platform Ops data > in Sept release results Everyone rushes Oct finalize result > tools 3-4000 users Commercial meets with product > put meeting notes  Use Case Clickup for product management - they have feedback there Link them to product requirements Keep the link alive At the moment, have that in ClickUp so its easy Want to move away from ClickUp at some point Also be able to track if themes have been resolved Tackled the first 5 How can I demonstrate that we’ve done something (Clickup today) Where does it start/stop? Clickup - export those - track them there If they get to 5,000 items they are pretty good If they direct integrate to Front - lots of customer inquiries - not actual feedback Remove the noise  Historical Data | Unresolved stuff they have -  Export whatever they have in Clickup - put that in Reforge - then moving forward remove the human layer Identify actual improvements they can make Total historical volume Trial Process Out next week - Tech  Can’t get an extract from Front GRESB",
    "full_length": 2423
  },
  "Auction.com": {
    "file": "Auction.com _ Reforge.docx",
    "text": "  Website Adnan | Product Managers Lucy | Product Managers 280,000 visitors a month Call automatically, solicit feedback Call people or have AI help you Human Input - from that part of view - can you be part of that conversation Process Today Calling users directly Sending emails Product - calling users directly Qualtrics Who? Depends on what they are trying to get to Interview in their own network Salesforce for ticketing How do you analyze that today? Dovetail - have used that - interviews / transcripts 1 month into it Volume - first use 100 users Not huge scale Total users - 7.5 million  Eventually it could grow Challenges Feedback Customer Account Internal Sources External Sources? App Store? - no mobile data Competitive Data? How much Data? Use VOIP tool to send interviewer NEXT STEPS Seemed sticker shocked at 5-10k / year Came in for interviewer - sees value in insights, but said they ‘aren’t ready’ for insights engine Could be a whale - they have 7.5m users on the ",
    "full_length": 986
  },
  "LottieFiles": {
    "file": "LottieFiles _ Reforge.docx",
    "text": "Malaysia Food Nature Danish Make sure product team has their eye on quantitative data Growth marketer for 7 years LottieFiles - 10,000 new users signing up per day Ecosystem of solutions Feedback Reviews Sometimes they miss feedback Much earlier stage Stack ZenDesk - support tickets - majority HubSpot - Enterprise customers Companies of a certain size / volume Typeforms all over tools Feature requests Danish summarizes everything - turns into a report - AI helps - quite manually Volume Every two weeks he does it 1,000 Doesn’t include everything - marks the ones as resolved AI Been a learning curve Part of the issue Have access to proprietary Claude/Gemini Every time he runs it -  Could be bad prompts Data is different every time One structured report - tells him similar stories every time Sentiment analysis is hard to pull out accurately Exporting CSVs of all data sources Results have been a bit inconsistent Minor issue MAJOR ISSUE - AGGREGATE Collating data is all very manual Takes about an hour to get the CSVs He sits in the middle of product and marketing Follow a cadence of growth experiments Every week they take a look at that data Before him - quantitative data from Amplitude Look at themes Vote on what would have impact Layer on 3 experiments a week Animation tool Have a plugin for it Every plugin store has their own reviews / rating system ZenDesk HubSpot  Sales/Service for Enterprise Monthly Volume 4,000 - 5,000 every two weeks Call reocrdings Process More so he’s looking at options Has looked at some other options Next Steps He’s pitched it to growth team, leadership team ZenDesk/HubSpot Volume/Month Integrations",
    "full_length": 1650
  },
  "Toast _ Reforge Insights Use Case.docx": {
    "file": "Toast _ Reforge Insights Use Case.docx",
    "text": "Toast / Reforge Insights Deployment, Support, and Success Plan Draft Reforge will help you step-by-step to ensure frequent and large adoption by your organization. Our general philosophy is to approach deployment like launching a product. Rather then building the “perfect” Insights instance, we’ll get it to 80% quickly, roll out to a smaller early adopter group, and adapt to feedback and successes. This way we get you to quick time to value while building momentum. From Data Ingestion (Step One) to Onboarding Group #1 is typically < 30 days (and can be faster). Step Description Goal Date Data Ingestion Finish mapping and ingesting all data sources and metadata including historical backfill. Provision access and setup SSO. Data connected, metadata mapped. TBD Accuracy Check Review data filtering and Themes accuracy by reviewing a sample of data. Data accuracy bar met TBD Map Your Team + Process Map your team structure, product taxonomy, goals, competitors, process to inform Tags, Reports, and Onboarding sessions. Context added to Insight Analytics. TBD Use Case Initial Setup We’ll help you set up your initial tags, reports and views.  Connect reports into appropriate Slack Channels to establish proactive, personalized “Feedback Rivers” for each team. Personalized use cases setup.  Right feedback, to the right people, in the right places. TBD Onboarding Group #1 Training session with you and an initial set of early adopter teams of how to use Insights, AI best practices, and more. X% of initial teams (team and use case dependent) activated in Reforge Insights TBD Gather Feedback + Questions Gather feedback and questions from Onboarding Group #1 TBD Adjust/Tune Setup Make any adjustments to Tags, Reports, and Onboarding based on the initial feedback. TBD Onboarding Group #2 Roll out to larger org after early adopter feedback has been addressed. x% of org using weekly within 30 days TBD First 3 Months Support Expansion We’ll support you in real-time via Slack on an ongoing basis. Formal monthly reviews for first 3 months. X% of org engaged weekly TBD Ongoing Support and Expansion We’ll support you in real-time via Slack on an ongoing basis. Additionally, we’ll do quarterly reviews to review adoption, use case expansion, and roadmap. X% of org engaged weekly TBD Reforge Insights Roadmap Reforge Insights North Star Our north star is to put an AI Researcher at the side of every relevant employee. Aggregation and analysis are only the starting line; the real win is a proactive engine that continuously spots unanswered questions, automatically gathers net new insights, and feeds bite-sized, validated problems and ideas into the team’s workflow. Launch Description Date Competitor Analysis Automated competitor analysis and monitoring of public feedback sources. Shipped In May ( Details Here ) Reporting Improvements Explore sub-themes visually, more granular sub-themes, account and contact level views, and more Shipped June 10th ( Details Here ) AI-powered N",
    "full_length": 4508
  },
  "ICP Targeting Guide _ Reforge Insights.docx": {
    "file": "ICP Targeting Guide _ Reforge Insights.docx",
    "text": "LinkedIn Sales Navigator ICP Targeting Guide for Reforge Insights Data-Driven Target Account Selection for Maximum Win Rates Based on analysis of 180 closed deals ($2.4M pipeline), this guide provides LinkedIn Sales Navigator filters optimized for your proven win patterns. Focus your prospecting time on accounts with the highest probability of closing at optimal deal sizes. Executive Summary: Your Winning Formula Key Performance Indicators: Overall Win Rate: 27.8% (50 won, 130 lost) Best Performing Segment: Small deals ($0-$5K) at 44.4% win rate Sweet Spot: $15K-$50K deals with 34.1% win rate Total Won Revenue: $793,858 across 50 deals Average Won Deal Size: $15,877 Strategic Insight:  Your highest win rates come from land-and-expand strategies starting with small pilot programs, then expanding based on proven value delivery. Part I: Industry Vertical Analysis & LinkedIn Filters Tier 1 Industries (Highest Win Rates & Values) 🏆 Media & Publishing (100% Win Rate) Success Example:  The New York Times ($175,000 total value, 100% win rate) LinkedIn Sales Navigator Filters:  Industry:   Media   Production,   Newspaper   Publishing,   Online   Media,   Broadcasting Company   Size:   1,001-5,000   employees   OR   5,001-10,000   employees Keywords:   \"content   management\"   OR   \"editorial   workflow\"   OR   \"audience   engagement\"   OR   \"subscriber   feedback\" Job   Titles:   VP   Product,   Head   of   Product,   Product   Manager,   VP   Digital Functions:   Product   Management,   Engineering,   Marketing Seniority:   Director,   VP,   C-Level  Why They Buy:  Complex content workflows require unified feedback from subscribers, advertisers, and editorial teams. High-volume user engagement creates feedback fragmentation across multiple touchpoints. 🚀 Logistics & Transportation (100% Win Rate) Success Example:  Uber Freight ($60,000, 100% win rate) LinkedIn Sales Navigator Filters:  Industry:   Transportation/Trucking/Railroad,   Logistics   &   Supply   Chain,   Package/Freight   Delivery Company   Size:   501-1,000   employees   OR   1,001-5,000   employees Keywords:   \"freight   matching\"   OR   \"logistics   platform\"   OR   \"supply   chain   visibility\"   OR   \"carrier   network\" Job   Titles:   VP   Product,   Head   of   Platform,   Product   Manager,   VP   Engineering Technologies:   APIs,   Mobile   Apps,   Platform   Architecture Functions:   Product   Management,   Operations,   Engineering  Why They Buy:  Platform businesses with multiple stakeholder types (shippers, carriers, drivers) generate massive feedback volume requiring AI-powered analysis for operational optimization. Tier 2 Industries (Moderate Win Rates, High Potential) 🔧 Technology & SaaS (50% Win Rate) Success Examples:  Autodesk ($45,000), Mixed results with Boomi LinkedIn Sales Navigator Filters:  Industry:   Computer   Software,   Information   Technology   &   Services,   SaaS Company   Size:   1,001-5,000   employees   OR   5,001-10,000   employees Keywords:   \"produ",
    "full_length": 18068
  },
  "WIN Reality": {
    "file": "WIN Reality _ Reforge.docx",
    "text": "AI Insights AI User Research Inundated with multiple products Talking to customers - making sure telemetry is in place Are you collecting feedback? Acquired two other companies this summer Mobile app - Swing AI Use a tool called Iterate for that - user survey tool Not much analysis Volume for feedback? Decent 50 survey responses / day Getting started with Research - ",
    "full_length": 369
  },
  "TripAround": {
    "file": "TripAround _ Reforge.docx",
    "text": "Build signup Context Setting - tell me a bit about your business Biz Model Their role + team structure Their AI maturity level Process - walk me through your current discovery process Listening for: manual, fragmented, limited resources, multiple products Consequences - what happens if you don't validate? Listening for: speed, time cost, adoption/retention/churn, modernization challenges, bias, making wrong decision Solution - whats your plan to fix this? Timing, Budget, Internal stakeholders",
    "full_length": 497
  },
  "Ernst & Young": {
    "file": "Ernst & Young _ Reforge.docx",
    "text": "Tab 1 Many digital products Auditors are using or in development Enablement is classic Video or print Products that don’t need enablement Integrate the guidance with the guidance itself Global Department - centered on internal marketing Drive the adoption of the material Partner ask: Give them overlays Chantal Manages a platform that digital products to users She doesn't get any feedback on usage Most analyzers don't have an integrated feedback product Feedback on the middle of the development cycle Decide on a new feature Testing may already have been done Chantal Internal platform Want to make it more popular to collect feedback Launchpad Internal site, uploading all enablement materials available for each product in Assurance Currently only have a small part in contact us and provide feedback Microsoft Forms is in place currently Really need this on the enablement AND the products Last 4 years - focused on developing the product Now - focused on feedback Tried to channel it via the launch pad Could also implement it into the  Tools for mainly internal folks Some are external - mainly its tools that their auditors use to audit Main users are the auditors Want them to get more digital - and use their products User adoption is low Tracking adoption Usage report AI chat functionality For others Analytics are hard to understand, not so easy to use  How many auditors Canvas - they have to use - 150,000 auditors Plus more - could be that other colleagues are in a audit AI assistant - just cracked the 40,000 mark New product EY canvas Not more than hundred thousand Niche scenarios Tools in your toolbox How do you benchmark how much usage there should be? Goal: Improving adoption overall Not sure if the product team has set goals? Metric: Client based, not users Make money - by eventually using it on their clients (external) How many clients  SOURCE Microsoft Forms Means of collecting the feedback herself in a harmonized, central way Other departments who collect feedback as well Product is currently not working Very specified question Product feedback in that case - more on I have this issue Analyze it? They haven’t really done that Biz center is concentrating on it a bit more New task in addition - team just got it How do we treat the data? Users who are employees Worker protection laws Check with legal on worker protection Is it possible to see individual answers from individual users? Individual answers - can they anonymize or pseudo  HOW DO WE TAKE ACTIONS PROCESS ON THEIR SIDE They have to convince leadership about this Give it some thought on their side as well Chantal - would love to have it tomorrow Product cycles Quarterly sessions Present new enhancements Next one is in January Microsoft Forms Connect me with a colleague from Australia Responsible for feedback - leading on the business testing center Testing events for the last 4 years - newly developed products Lindsey Crouza She manages  Tab 2 Lindsey Looks after the business testing cente",
    "full_length": 6761
  },
  "Neo": {
    "file": "Neo _ Reforge.docx",
    "text": "Tab 1 Krizia Napolitano Program Manager Company Fintech in Canada Initially - not direct to consumer Before Hudson bank CC went bankrupt - Tims is a NEO cc Working with other large retailers to get other CCs for customers Have their own CCs as well Still do some of that MOVING MORE TO BEING DIRECT TO CONSUMER NEED BETTER FEEDBACK LOOPS CC, Accounts, Mortgages Also limited retail banking - limited accounts - also high interest savings account Also have mortgages as well Mostly credit - most of their customers are sub prime customers - looking for access to credit Rewards network, credit building Process now to analyze / synthesize Monthly NPS survey Collect all disposition data Process them to tag them about what customer called in about Complaints data Review data Anecdotally what people talk about on Reddit - don't have a official way to scrape it Volume? Taxonomy of improvement areas 3,000  Have monthly reporting on what problems  Sources Surveys, In App Feedback forms, Reddit, Support Interactions, Reviews, Interviews Surveys - TypeForm ZenDesk Stack Salesforce, ZenDesk, Amplitude SendGrid, Slack Context Trying to set up better VOC / feedback loop Do interviews with customer base Don’t have a good way to do external research Internal user base Manual - GMeet invites See if there’s a way to interview more customers AI interview tools Nature of interviews - early on in product interviews Problems they are facing that they are looking to solve Reporting Month over month mentions Issue tree Tracking month over month - roll out a improvements 3,000 comments a month Don’t do any transactional surveys Paying the CC bill with Neo could be easier Security resources Open Qs Are product people involved? Where are your calls? Buying Team Mostafa Elhefnawy  - Head of Product & Growth Christiaan Steyn  - Director, Data & Infrastructure Yacine Bara  - Director, Operations Stefan Doan  - CIO Brandon Rochon - Head of Biz Intelligence & Data Analytics 2026 Company Context MOVING MORE TO BEING DIRECT TO CONSUMER NEED BETTER FEEDBACK LOOPS CC, Accounts, Mortgages Process now to analyze / synthesize Monthly NPS survey Collect all disposition data Process them to tag them about what customer called in about Complaints data Review data Anecdotally what people talk about on Reddit - don't have a official way to scrape it Sources Surveys, In App Feedback forms, Reddit, Support Interactions, Reviews, Interviews Surveys - TypeForm ZenDesk Native: App Store, Google Play, Reddit, G2, TrustPilot, TypeForm Non Native: Calls,  Volume Annual surveys: 30-40,000 Calls & Chats: 4-500k 15-20k per month - avg 15min Stack Salesforce, ZenDesk, Amplitude SendGrid, Slack Context Trying to set up better VOC / feedback loop Do interviews with customer base Don’t have a good way to do external research Internal user base Manual - GMeet invites See if there’s a way to interview more customers AI interview tools Nature of interviews - early on in product interviews Problems they are facing",
    "full_length": 6115
  },
  "GTME Campaigns": {
    "file": "GTME Campaigns _ Reforge.docx",
    "text": "All Warm | EDU Signups | Dec 2025 IC | Build Path Sequence Manager+ | IA/Build split Cold | Native Integrations | Dec 2025 Resources AI Native Product Team Feedback Frag Tax Build prototypes using extension IA using sample data",
    "full_length": 227
  },
  "Yazio": {
    "file": "Yazio _ Reforge.docx",
    "text": "Tab 1 Grainne Courses - have done them at different companies Looking at the Starter Pricing, contract length, live cohorts Kate Build and Research 2026: Become prototype driven Mindset, culture User insights, user feedbacks Dont have a strong discovery model Questions How can this link up with Omni Definition of insights is a little wooly - quantitative testing Insights Something you validate Put into a process - put into a roadmap At Yazio Different meanings Not just enter user -  Next Steps They are going to trial Build and Research Get them connected with Laeka on the courses side Mobile vs. Web 3 out of the 4 are mobile 4th is web squad Experimented with Lovable Working with Replit Long term vision: Take a web view and embed that into their app Get some data interacting with users Empower their teams to ideate, prototype - get real ideas in front of real users Determine what to build - how to build it Idea > build > A/B test > then build - expensive In early stages of what they actually need Because they have this web/mobile view DESIGN IS EASY Replit - design system is Enterprise range Design - mid to lower tier cost Replit Enterprise tier Tons of changes on that side Quoted them platform fee of $20k annual, $100 per person per month - Enterprise plan $25/per person/month – per seat - feature restrictions Team size: Relatively small Product team 17-18 people on product - includes PMs and Designers Couple motion graphic designers Has 6 people testing out Replit - 2 designers and 4 PMs 4 squads - 2 PMs per squad - at least 1 designer per squad Discovery New Director of Product Goes on Pat leave - last day is on Monday He is driving discovery playbook piece Working very closely together",
    "full_length": 1718
  },
  "Togal.ai": {
    "file": "Togal.ai _ Reforge.docx",
    "text": "Pre Call Analysis 🎯 Key Opportunity Togal.AI sits at the perfect intersection of  AI-first construction tech  and  rapid scaling challenges  - exactly what Reforge specializes in solving. This isn't just a product education sale; it's a strategic growth partnership opportunity. 📊 Company Intelligence - Togal.AI Core Business: AI-powered pre-construction takeoff software that automatically detects, measures, compares and labels project spaces and features on architectural drawings in seconds, not hours   Togal Togal 940% growth in 2023 - going from 250 users in 2022 to more than 2,600 users   AI in Construction Has Biggest Growth Ever in 2023 | Togal.AI Clients like Coastal Construction saved ~$1 million in first-year savings   6 Ways AI Makes Construction Faster, Safer and More Efficient | Togal.ai Key Players: Patrick Murphy  (CEO) - Former congressman, Executive VP at Coastal Construction Johnny Maghzal  (Head of Growth) - Your meeting contact, Civil/Industrial Engineering + MBA background Sian @togal.ai  - Also on the call Strategic Position: First AI-powered takeoff tool in the industry with multi-year head start   Why Togal.AI is Lightyears Ahead in Construction Tech | First to integrate ChatGPT in construction industry   ChatGPT Enters the Construction Industry with Togal.AI | Togal.AI Recent hire of female head of marketing (Kelsey Formost) after 940% growth   Togal.AI | LinkedIn 🚀 Reforge Strategic Value Proposition For Johnny Maghzal (Head of Growth): 40+ expert-led courses in product management, growth marketing, AI strategy, and leadership   Reforge Helpscoutdocs Proprietary content built from research with leading CEOs from Pinterest, Yelp, Slack, Airtable, Uber, Spotify, Airbnb, Netflix   Investing in Reforge | Andreessen Horowitz Focus on mid-career tech professionals in product management, growth, marketing, and engineering roles   Reforge: A Startup Case Study – Fueling Tech Career Growth Perfect Timing Factors: Hypergrowth Challenge : 940% growth creates operational complexity that Reforge courses directly address AI Leadership : Both companies are AI-first innovators Team Development : Recent marketing hire suggests team scaling needs Construction Tech Pioneer : Need frameworks for maintaining market leadership 💡 Strategic Conversation Starters Opening Hook:   \"Johnny, I see Togal.AI achieved incredible 940% growth last year. That's the kind of hypergrowth that creates fascinating operational challenges - how are you and your team navigating the transition from startup execution to scale-up systems?\" AI Strategy Angle:   \"Given Togal's position as the first AI-powered takeoff platform, I'm curious how you're thinking about maintaining that competitive moat as the construction industry rapidly adopts AI?\" Growth Framework Angle:   \"With your background bridging engineering and business strategy, you probably see the complexity of scaling technical products in traditional industries. What frameworks is your growth team using to ma",
    "full_length": 17458
  },
  "DreamHost": {
    "file": "DreamHost _ Reforge.docx",
    "text": "Tab 1 Layering quant on top of qual — start with qual Justin Lund - Director of Product Ralph Castro - VP of Products 1.5 million customers 6+ product lines What sources are you getting feedback from today?: Centiment ai deep research  competitor analysis  direct customer interviews  hotjar in application surveys What about: Support tickets? Either CEX reporting Employees can ‘flag’ a CX channel with problems people might be experiencing More high level Also will put surveys right into their panel - will do that around launches Chat transcripts? Forums? Billing/Cancellation feedback? Sales calls? NPS/CSAT? Feedback Fragmentation Tax Time - spent aggregating/analyzing Translation - erosion of customer truth via handoffs Trust - every dept claims their feedback is most important Tech Debt - cost of maintaining or building features without clear evidence of value Aggregate  Analyze Area of growth!!! One PM using Productboard to collect all that information on his roadmap Also use Clickup - heavily use it Have a lot of customer data points - want to understand it as a whole Manual process to understand the data points they are getting Very focused on features or products they are launching (recordings in control panel) - understand user flows Surveys/Interviews — VERY MANUAL Act Take feedback and move it directly to roadmaps for roadmaps / product lanes Higher level - committee level - set priorities Filters into those lanes Worried about the lack of formal feedback structures Looking at using a company called Centiment to run these surveys for us Do regular surveys with HotJar - control panel or emailed Regularity Not a lot they are doing on a consistent basis User Interviews Next Step Doesn’t have a solid plan formulated yet If they could get – By next week Collect a first round of data to analyze Share that I’ll set up Slack channel One of key members is at Cloud fest Tab 2 Ralph: Build up the product team Internal staff - help them transition into product roles Also Be more mindful of budget going into new year Look at all available tools Help them make decisions In a time of change Hosting is changing They are predicting less and less people to choose WP to build their websites Was a BIG FOCUS of theirs How do you make decisions now? Back to a developer focus Hosting that is built more to help with developer pipelines from IDs to deployment Build a website >> then applications Two use cases Also trying to build proficiency - product coordinators - on a growth path - help upskill them - creating a syllabus to help train internally - also have them be enhanced with a tool Volume / Sources 12/18 — QUOTED HIM $20K for 5k/data/mo Said thats in the range IF they add email its 1k/day email threads - which is 30k/mo - 360k / year At .12cents - $48,216 PLAN: Offer him the full Monty - meet in middle on cost ($35k all in?) —---------------------------------------------------------------------------------------------------------------------------- Volume N",
    "full_length": 5629
  },
  "Triple Ten": {
    "file": "Triple Ten _ Reforge.docx",
    "text": "Coding bootcamp Have different feedback sources Never centralized Researching feedback tools Store it in one place Analyze Ask about insights with AI to do summarize Current State Customized survey on their platform Embedded in their lessons Store in data warehouse Her team gets in spreadsheet Filter questions Product / Manager who is responsible for specific part of the product Ex: Educational program Download time frames, program, questions – analyze manually once a month Post Hog Recently was HubSpot - she believes HubSpot >> ZenDesk Typeform How is that going? Manual process to analyze Using LLms “It’s ok” - if product managers have something in their mind, can just go to a place >  How does it get into production? Quarter planning Think about areas they’d like to focus on Later - what projects might be in these areas Each product manager works on documentation / description of this problem – use whatever data they have - analytics + research Volume 10-20,000 lines of data 12,000 in 8 months or less Calls She conducts interviews - would be nice to get this in Most calls are sales team - they use a separate software for that Insights7 Future State Would like it to be easy to use Need to add context Educational platform Communication Ask questions based on this context and feedback Budget 12-20,000 data points Gave her quote for $10k for 10k data points Legal approval One month Timing End of October possibly Want to do it in Q4 Competitors in play Paylon? B2B product Buildterra? PostHog -  Process to buy",
    "full_length": 1531
  },
  "Rydoo": {
    "file": "Rydoo _ Reforge.docx",
    "text": "Using ProductBoard Renewal is coming up CSM Sales Any source of communication Send everything to productboard Process it Main challenge there Often - a PM doesn’t want to do the manual work Could be more automated Give me a Excel with all feedback related to my area Use AI to have a conversation with it Volume 1-3,000 ‘notes’ Types of feedback they are collecting Some isn’t always relevant Use Gong for calls CSM interviews Sales / CSM will just give a summary Balance Customers you’re getting feedback from Strategic priorities 3,000 30,000 data points 10-20k range",
    "full_length": 569
  },
  "Backroads": {
    "file": "Backroads _ Reforge.docx",
    "text": "Insights / Research How do you collect feedback today? Surveys UserTesting.com Primary ways today Volume of feedback – annual basis Fair amount 50 responses a week Ad hoc surveys - not really that great Own survey tool Intercom Salesforce Trying to be more disciplined Drupal Let me ",
    "full_length": 283
  },
  "EvenUp": {
    "file": "EvenUp _ Reforge.docx",
    "text": "Company Fit Analysis EVENUP PROSPECT ANALYSIS PROSPECT SCORE: B+ (Strong Fit, High Potential) Justification:  EvenUp is a high-growth, well-funded B2B SaaS company with significant user volume and multi-product complexity that generates substantial feedback fragmentation. While not a traditional marketplace, they serve 1,500+ law firms with ~18,750 total users across multiple product lines, creating ideal conditions for scattered feedback analysis needs. KEY FINDINGS Company Profile & Scale $1B Valuation, $235M Raised  - Recently completed $135M Series D (October 2024), indicating strong budget availability and growth trajectory   evenuplaw Business Wire 1,500+ Customers  - Serving over 1,500 personal injury law firms ranging from solo practitioners to America's largest PI firms   EvenUp Announces First-Ever Personal Injury Pioneer Awards, Honoring 10 Law Firms for AI-Driven Innovation High Volume Operations  - Generating 1,600+ demands and medical chronologies weekly, processing millions of medical records   EvenUp | Personal Injury AI — From Intake to Resolution Large Team  - 100+ legal experts (nurses, paralegals, adjusters, lawyers) plus 100+ engineering/product team members   LawSites Evenuplaw Multi-Product Platform Complexity Expanding Product Suite  - Claims Intelligence Platform, AI Demands, AI Playbooks, Voice Agent, Case Companion, Settlement Repository   LawSites Evenuplaw 20% Multi-Product Adoption  - Customers already using multiple products, indicating cross-product feedback complexity   Premji Invest | EvenUp: Pioneering Vertical AI to Disrupt Personal Injury Law and More Rapid Innovation  - 50+ product releases annually, creating continuous feedback generation   Lightspeed Venture Partners LawSites User Volume Calculation Estimated 18,750+ Total Users Across Customer Base: 1,500 law firm customers 5-50 users per firm (attorneys, paralegals, case managers, support staff) Multiple user types with different workflows and pain points Additional internal team feedback from 200+ employees FEEDBACK FRAGMENTATION ANALYSIS Multiple User Types Per Customer Partners/Managing Attorneys  - Strategic product decisions, ROI feedback Associate Attorneys  - Daily usage feedback, feature requests Paralegals  - Workflow efficiency, document quality feedback Case Managers  - Client communication, process optimization feedback IT Administrators  - Integration, security, technical feedback Multi-Product Feedback Sources AI Demands  - Settlement letter quality, accuracy feedback   EvenUp Announces AI Playbooks™ and Voice Agent™ to Redefine Case Analysis and Client Communication   AI Playbooks  - Case analysis insights, pattern detection feedback   EvenUp Enhances Its Platform for PI Lawyers with Two New Features: AI Playbooks and Voice Agent | LawSites   Voice Agent  - Client communication effectiveness, satisfaction feedback   EvenUp Announces AI Playbooks™ and Voice Agent™ to Redefine Case Analysis and Client Communication   Case Companion  - Documen",
    "full_length": 12518
  },
  "Ovoko": {
    "file": "Ovoko _ Reforge.docx",
    "text": "Tab 1 Used car parts Lithuania based Operating in France, Romania, Portugal, Spain, Italy Pain point Systemize everything  Channels today Direct chats with customers Support tickets Heavy users pitch their ideas Use ZenDesk Analysis they use Maestro QA - shes not familiar with it - its new to her Just for ticket analysis Do the customer calls manually - going to scrap yards - specific qs Directed to new feature launches Customer data in their platform They have two separate biz units One is marketplace Buyers to look for parts If they have claims from buyers Goes to ZenDesk SaaS platform B2B sellers They use this platform for car parts Its only HER SECOND WEEK These parts are placed in B2B saas platform - synced to marketplace No process for analysis of customer feedback She is responsible for that Feedback is very scattered Tickets is less painful for them For her personally - most interesting Surveys Multiple languages Legal Qs Would need to sign NDA Will their data be held in US data centers Leaving 3 weeks vacation Back on 11/27 Next Steps Shes going on vacation for 3 weeks Interested in IA Surveys ZenDesk already has some analysis tool called Maestro we’d have to beat",
    "full_length": 1191
  },
  "KeyLoop": {
    "file": "KeyLoop _ Reforge.docx",
    "text": "Tab 1 Harry Raven Did a course - enlightening Joined 6 weeks ago AI assisted Product perspective Prototyping Kicking off AI driven products Taking an idea, getting it into production end to end Eng capability Insights / Feature Flagging Launch AI Interviewer Scale deep insight across personas internally - extend to customer base Lots of different touchpoints to customers - pro services, activation, delivery teams Lots of that qualitative insights get lost Question is raised - Skype/Teams - answer it, don’t gather that feedback downstream Structured surveys as well Platform perspective Quarterly surveys Niche use cases - good value Internal developer surveys Internal surveys Frequency is so low Bundle in NPS with product - as opposed to, we made this change Broader questions How do you analyze that today / synthesize 1 big survey that goes out 100 recipients Internal Big driver for them Launch Sandbox where they can see it working Set up test account Hard without fully integrating with product Tab 2 Team demo | 11/24 Retailers Manufacturers Fleet suppliers Insights Aggregate surveys + interviews Research Internal Survey? End of year? Build Team features Questions: I can get a list of questions if that would help, but as Reforge is early, I'd love a strand of it to be around the direction of the end to end product and outcome driven development.  Further to this, how Reforge is looking to leverage it's deep understanding of the Product Manager role in the agentic decision making on top of its features.  AI team Two workstreams Macro Daniel Head of Agile Excellence Looking at tool landscape in product Looking much broader What does good look like? Marty Connect knowledge fabric - give it more context - enrich it with that context Alastair - director of data - head in the clouds AI ideas at people - seeing what sticks Harry - micro, team level Target ICP Product / Growth Roadmap Split product team into what they have Domains Segmented into 4 domains Split again into subdomains PM, come in on a Monday Something will require their attention BMW came up with a requirement in italy Their job is to think about the thing that came in Insights What other things are in that same area? Ultimately A plan React  Roadmap Customized set of categories Can items in that list be actually pulled from a tool like Jira - where they have the items stored as a source of truth Jira - reflects where they’d go on the roadmap Integration of Insights > link Insights to those items Enrich Domains and sub domains Deeply manage the context for  SUPPLY DEMAND OWNERSHIP Prioritize and manage themselves 200 products 100 engineering teams 5-6 data points / month  Summarize: What kind of metrics do we need? Marty Look through some of the interviews as well Daniel - most interesting one Daniel Will need Insights Still trying to understand the problem they are solving Talking to Miro Insights Sources Surveys Interviews 1/21 Been hard over last couple months on what they are doing Issue",
    "full_length": 4075
  },
  "Multiverse": {
    "file": "Multiverse _ Reforge.docx",
    "text": "Multiverse AI upskilling for B2B multiverse.io 36k/mo traffic Runs apprenticeships - people who are already in work Focus on AI data / engineering - mostly tech space Moving more and more towards AI programming Leading apprenticeship provider in UK  7-800 EE at moment Unicorn based on last valuation B2B2C - work with biz to get apprenticeship money Vast majority of users are apprentice people Research Team Work in different areas - different responsibilities Interested in Research product Tool that can help them get on top of all the insights they have as a company Stakeholders to self serve a bit more People Audrey Chung - Researcher - 3 years Responsible for end to end journey - CX Alex UX researcher - moving into voice of learner role - LSAT / collecting feedback - closing the loop Emma Bit new - few months ago Voice of customer angle - building that out - sentiment / CSAT Tom Knoll Senior UX researcher Research Direct research Bespoke surveys Ongong surveys - Emma/Alex Also other sources Intercom data Gong data Salesforce Quite a sophisticated data/insights team and function that do a lot of the collation of data What they are missing Go across all functions and all sources Firefly - internal tool - aggregates data across some sources, not all - tries to identify themes based on that Gaps? Enterpret - Emma Notebook LLM How well does that work today? Probably not optimizing the tools they have today Enterpret was more built for market research Enterpret -  Human in the loop training heavy Optimized for Support/CX More dashboards >> we lean on chat How could this fit into your current process today? Does solve some of the problems they are trying to solve Doesn’t do: Want a way for people to be able to call Library of their research reports - only those things Primary analysis on raw data They have PDFs of interviews they’ve done Survey they’ve done Make sense of it Business has at the moment Only be able to ask questions of that - understand what they’ve learned from that Research reports would be highly curated Insight, context, personal info already removed, very clear how its relevant to the company Safe insights for the other stakeholders to peruse themselves Repository Get back to them on an answer for that - can they search specific  Enterpret Recently released chat functionality - hasn’t explored it yet Procured last year Went through taxonomy definition - have iterated a few times Started to - haven’t been maxmizing it - Emma only joined a few months ago Main use case - Gong side - untapped source of insight Next Step Regroup, discuss their thoughts, align internally",
    "full_length": 2624
  },
  "AwardCo": {
    "file": "AwardCo _ Reforge.docx",
    "text": "Adam Meadows Product Team 18 teams - 100+ Company Recognition software for B2Bs 165M Series B in May 2025 Corporate Buyers End users (employees) Tech: ZenDesk? Context: Has played around with it - haven’t used it a ton Growing fast, generally younger product org He is trying to champion emerging technologies Playing around with several tools for prototyping What he liked: Easily make prototypes look like their product Design interplay Case by case Team by team Collaborative effort Designer is usually building it out in Figma He brings it - or someone in product initiatives it with the strategy For them: What are key assumptions / process Feedback process Use different tools If its live - most teams hop on a zoom call and do notetaking Feed that to a notebook LLM Manual They use UseBarry as well Gives you insights / reporting If it can identify: 3 core factors to consider when creating that design / prototype",
    "full_length": 921
  },
  "HiveMQ": {
    "file": "HiveMQ _ Reforge.docx",
    "text": "Company Industrial AI platform to manage data centers Tim Hall New Head of Product (Oct 2025) Stack HubSpot/SFDC Slack Reddit G2 Figma Person Discovery Who are they? What is their function/role? Company Discovery What’s the company? Prototyping Discovery Where are they on their prototyping journey? A couple people using? Whole team using? New? What problems have they been trying to solve with prototyping and why? What other tools have they tried? What they like and issues they’ve ran into? Evaluation Discovery Where are they at in their product evaluation journey? If active, the core criteria they are looking for? The steps? How will they make a decision? What is this person’s role in evaluating prototyping for their company? Learning - EDU 10 seats Small team of PMs access  ",
    "full_length": 786
  },
  "NationBuilder": {
    "file": "NationBuilder _ Reforge.docx",
    "text": "Tab 1 Goals Explore Insights aggregation AStephens - Big Reforge guy for a long time Aggregate info Challenges Slim team, glean a lot of insights they are getting Feedback Customer Account Internal Sources NPS Intercom Email Surveys Churn surveys ProductBoard CRM? HubSpot Custify Jimini - transcript data from that Total Addressable Data Qualitative feedback | Could / should be getting more 12-15,000 feedback External Sources? App Store? - no mobile data How do you do this today? Pretty disconnected Have NPS flowing into some of the systems ProductBoard uses it to determine product roadmap stuff Win/Loss reasons from sales How well do you understand the customer? Growth – ad hoc team More to learn there - better sense of feedback / trends / pain points Dial in - improve lifecycle marketing stuff Erica Customer Retention / Support - moved into Marketing Decisions around how to time and personalize orchestrate lifecycle comms - have been based on data + growth engineers - opinionated feels Marketing Team: 3 maybe - sub contract out 1 person doing lifecycle marketing / engagement / retention Rethinking support org - using AI for support Competitive Data? TIE DOWNS Shifting to Customer Experience Organization Practical reasons Org shifts Churn has been a concern - oriented around ARR Mentality - try something different - stagnating on retention / churn Resulted in ARR VOLUME Ranges Categories Staff NPS Intercom 5-7 a day How much Data? Pasa Robles, CA Company is remote Alex Stevens - Growth Big Query - Warehouse Segment Run one more call Homework - how to chop up existing data Exit survey Productboard Enterprise Churn Survey Get in front of Product Team Integrate multiple data sources 15,000 users per month PRice Optimization Survey Willingness to pay Data So far in 2025... - 1500 NPS surveys (Wootric) - 65 Churn Surveys (Slack) - 300 Feedback Submissions (Slack) - 1100 Exit Surveys (Google Sheets) $10k includes up to 5k/month feedback data points Demo Flow Aggregate Data sources Faster time to value to get these data sources analyzed First thing we do is extract what we call a ‘SNIPPET’ (Raw feedback insight) Call may be multiple things Support ticket may be one Tie it to the metadata we have in the system Analyze Cluster it into THEMES Yes, we summarize the theme - you can chart all this data, segment it by the metadata, and immediately get to the raw data that makes up the theme Quantify impact of addressing this theme Process historically could take days - if not weeks - is instant TAGS | ALLOWS US TO SET UP REPORTS ON THE LABEL Workflows - can pipe a specific tag into Slack Act Explore all this data with natural language BB Education for 9 years Big bet when we say AI-native product teams Work more efficiently Build better products This problem space - first we really identified Spent about a year analyzing the space Came across the Monterrey team Ingestion, processing > makes all the downstream stuff work Product slide ‘how do we help people und",
    "full_length": 5298
  },
  "Tie": {
    "file": "Tie _ Reforge.docx",
    "text": "Context Company Deanon website traffic People Aya Gare - Senior PM - Boston Ellyson Beyer - Customer Success Manager Marc Lerebours - Senior Rev Ops Manager 2 months De-anonymizing visitor data Jonathan Mannix - COO Others Harsh Patel - Head of Data / AI Eric Cox - Head of CS John Levis - Director of Product Marketing Jonathan Kopnick - CTO - Miami Company Context: Series A company 38 EE total Lots of unknowns - historically - had disparate ways of customer insights Central store to collect all this insight - comparing whats possible in SFDC - whats possible in Reforge Aya has been there for about a month De-anonymizing visitor data Why Reforge Want to systemetize product requests, feedback they receive Looking for Integrations | layout with Salesforce - reporting For team - same visibility within tool and SFDC Incorporate in day to day flow Stack SFDC Slack Zendesk? - evaluating it currently Probably going to onboard that or similar tool JIRA - product dev team Sources Google docs and google sheets - circulated around team via slack/email Not super organized process In past companies - used streamlined reports to Salesforce - tie feedback to specific account - ARR to those accounts Streamlining the workflow (CS, AE - add product feedback) Seamless — not a barrier to add product feedback Total amounts of reports for product feedback - how many accounts have been uploaded, account value tied to that feedback Churn risk, etc CS fields the external feedback - on front lines Calls, emails, customer slack channels Use Gong today - no way of pulling in that data in a automated way yet Use Gmail - also use Superhuman Take that, escalate it in internal documents Can get disorganized - can be difficult to catch all feedback Volume Quite limited for the time being Customer feedback every other month - every 3 months Do have objections prepared to discuss those More volume — internal ideas — roadmap of what the team is working on 4-5 CSMs Process Today Future State Business Impact PROCESS - Trying to get this done in the next week or two -Any stakeholder can provide feedback into their system -Digest that, organize it, prioritize it -Want to have a roadmap ready for the new year Jon JIRA integration Pricing Evaluation process Converge, make conversation about what they understand to be the benefits of Reforge Sync on that with Mannix or Jon URGENCY???? Gong SFDC Slack Jira PB Manual tagging - AI powered ingestion AI bolted on top of non AI product - issues with accuracy Reactive vs. proactive Next Steps URGENCY??? TIMING??? EVALUATION PROCESS??? BUDGET??? Team Integrations: Calls Gong Historical calls Granola Google meet recording Sometimes they use Zoom Slack Specific channels in slack to start ZenDesk Google docs / sheets - drive things as well Confluence / JIRA JIRA - tickets You can send in tickets -  Status of those projects / features SFDC They do everything now in Salesforce - what they gather from customers - stage a customer is at  Snowflake / BigQ",
    "full_length": 3400
  },
  "Skelar": {
    "file": "Skelar _ Reforge.docx",
    "text": "App - users  Reforge Scale up mode Want to improve their AI companion How much customer feedback per month 200,000 active users per month Cancellations - 300 monthly Inna and Mariia",
    "full_length": 181
  },
  "Procore": {
    "file": "Procore _ Reforge.docx",
    "text": "Tab 1 SITUATION Questions (understand current state): \"Walk me through your typical process when you're trying to decide what to build next for the scheduling module. Where do you start?\" \"What tools or sources do you use to gather customer feedback today? I saw you have Salesforce, Hotjar, and a few others...\" \"How do you segment feedback by user type - like separating what GCs want vs. what specialty contractors need?\" PROBLEM Questions (surface pain):  4.  \"What's the most time-consuming part of that research process for you?\" \"When you're trying to answer a specific question - like 'why are customers requesting Gantt chart improvements' - how long does it typically take you to get a comprehensive answer across all feedback sources?\" \"Have you ever made a product decision and then later realized you were missing important feedback from a source you didn't check?\" IMPLICATION Questions (make the pain bigger):  7.  \"What's the cost if you build the wrong feature or miss something important in customer feedback?\" \"With 30+ product modules at Procore, how do you ensure you're not duplicating research efforts with other PMs? Is there a centralized feedback repository?\" NEED-PAYOFF Questions (get them to articulate the solution):  9.  \"If you could wave a magic wand, what would the ideal customer feedback analysis process look like for you?\" \"What would it mean for your team if you could cut the time spent on manual feedback research by 70-80%?\" Tab 2 \"Matt, before we dive in - I should mention my colleague Jonathan spoke with Allen Kim a few months ago. Allen mentioned you're using Unwrap to analyze your support tickets and feedback across the org. I'm curious - as Principal PM for Scheduling, how does Unwrap work specifically for your product roadmap decisions? Does it give you what you need, or are there gaps?\" LIKELY SCENARIOS & HOW TO HANDLE Scenario 1: Matt says \"Unwrap is great, we're happy\" Response:   \"That's awesome - sounds like you're in good shape then. Out of curiosity, is there anything you wish it did that it doesn't? Or are there other areas of product intelligence you're focused on beyond feedback analysis?\" (Then pivot to other problems or gracefully exit) Scenario 2: Matt says \"Unwrap is okay but...\" Response:   \"Tell me more about the 'but' - what's missing or not quite working?\" (This is your opening - dig into pain points and position Reforge around those specific gaps) Scenario 3: Matt doesn't know Unwrap well Response:   \"Interesting - so it sounds like maybe Unwrap is more for support/ops teams than individual PMs like you? Walk me through how you personally gather customer feedback for scheduling decisions today...\" Tab 3 Unwrap Are you able to tie this to business metrics? CRM data? Is it in the PM workflow? We don’t charge based on number of sources integrated Unwrap Funded by CS/CX? Or Product 20-30k support tickets Reddit/App Store/UserVoice Calls? Sales/Support Today: PM - corp objectives P&T objectives PM - how does ",
    "full_length": 3193
  },
  "Team Blue": {
    "file": "Team Blue _ Reforge.docx",
    "text": "$100mil ARR 70 brands 14 of them - 2/3rds of revenue comes from domain/hosting 3.3M small-medium businesses Appointments, social media management, compliance - acquired 30 brands - specialized vertical (nonprofit) 3.3M customers Take a small amount of their digital operations wallet His job and their team - bring those two businesses together New customer bases  Single biggest challenge Taking a product that is built like Metrical - for customers highly aware of benefits/pains of social media Already looking for a solution Introduce that proposition / product to another customer base - coming to them for primarily for domains/hosting Experience: Adapt/play around with that Natural domain and hosting journey Integrate product more deeply Lots of efforts What he liked: Rather than do this outside and unrelated Metrical Deliver a personalized onboarding / social media coaching experience Not taking the whole product and changing it Prototyping that Got 70 brands Justify a deeper integration - more product time Test the market New props when they buy new brands Before they go to an integration - test a limited feature Is there an element of research that goes into prototyping? 90% of their revenue is generated with zero touch Self serve Expose it to 10% of traffic Set out to do this - not doing it Have internal user groups Can go and recruit Focus groups Expand it to 10% Let the user do the talking Feedback collection? CSAT Large contact center team Call business Have been using Replit Quick prototyping Their team Sit in commercial Responsibility for adapting product Cross functional 3.3M customers Core businesses Smaller, SaaS businesses - maybe Use cases for Resources Social media engagement scores Influencer engagement scores Going out - very specific ones Also - getting first 1-200 customers from B2B Rooto How did you come, how is onboarding, etc Insights - work with Adrian, Rok - put in data sources (include DWH) Run something with Letti on Research",
    "full_length": 1984
  },
  "Moma": {
    "file": "Moma _ Reforge.docx",
    "text": "Dont want to watch all the steps happening",
    "full_length": 42
  },
  "Scan": {
    "file": "Scan _ Reforge.docx",
    "text": "Tab 1 Tom Hawkins VP, Marketing Scan Making medical imaging accessible to everyone around the world Scan.com is transforming diagnostic imaging, a $500B+ global market, by rebuilding its outdated infrastructure from the ground up. Having built the UK’s largest marketplace for self-pay MRI scans, we’re now scaling at breakneck speed to become the world’s leading medical imaging platform. Our mission is clear: make medical imaging radically accessible—because early, efficient diagnostics save lives. Inefficiency shouldn’t cost lives. By integrating fragmented imaging providers, payers, and technology into a seamless, modern ecosystem, we’re creating an effortless, patient-first experience that improves healthcare outcomes globally. Backed by top-tier VCs across the US & Europe, we’ve raised $50M+ to date and are just getting started. Details 92,000 visitors / month Patients Imaging Centers Referring Clinicians Enterprise Partners (insurance) Tech HubSpot ZenDesk Front Dialpad Anonymize data coming in Not HIPPA compliant On US side Testing product market fit Tab 2 Scan.com  - been around since 2018 He joined Jan 2022 - when they got their seed funding Task: Growing UK for consumer imaging Connect people looking for scans with private imaging centers Also spun up B2B operations - clinicians to refer, insurance, affiliate End of that year - launched in US - idea was to replicate the B2C model Found a wedge in the personal injury space - get into accident, need a scan - goes into case settlements In Georgia initially Hard to build the supply side - regulatory framework is advantageous Scaled to 6-7 other states - all PI - B2B only - 90% of growth is driven by US UK growing more incrementally He works across B2C/B2B in UK and US This year and next: More states Additional payer types (commercial insurance, self pay, workers comp) He was very early side - educational learning SHOULD BE SPEAKING TO MORE PATIENTS Bit stop/start Manual Half an eye on the market, how do they gather more insights > use those to inform product/marketing roadmap He runs the marketing team Have a VP of Product and Sales in US Consistently gather insights, push them out Process today: Do record sales calls - dont do much with it A lot of US sales calls are direct, face to face When he interviews Email people - incentivize - use Granola to record the calls Summarizes key themes Full body scan products specifically - people who’ve done a scan More of a continuous process - specific things they want to ask Themes and insights that come out of the data Finger on the pulse",
    "full_length": 2579
  },
  "OLX _ Reforge(1).docx": {
    "file": "OLX _ Reforge(1).docx",
    "text": "Feedback - Reforge Research Most natural sounding Overall experience 3 or over We beat Mace on testing - felt more natural, users felt more confident Portugese - it was Brazilian - need support for Portuguese Mace Most comfortable Brazilian / Portuguese Multi language support in Brazilian Right now: Not there yet Dont have consensus - interesting - becoming a tool Specifically Customer centricity focus End of this fiscal year Not moving in any direction Beginning of fiscal year Top 3: Being able to show prototypes and get feedback on them They are using lovable today Being able to connect this to a prototyping tool Run user testing with AI Languages being dialed in Representing them as a brand Using Lovable across the whole team - marketing too",
    "full_length": 754
  },
  "Meridia": {
    "file": "Meridia _ Reforge.docx",
    "text": "Tom Hazeldine CPTO",
    "full_length": 18
  },
  "Egyptian Global": {
    "file": "Egyptian Global _ Reforge.docx",
    "text": "Ahmed Saad | Growth Marketing Strategist",
    "full_length": 40
  },
  "Outbound": {
    "file": "Outbound _ Reforge.docx",
    "text": "Campaigns Campaign #1:  Strategy: Broader reach List: All companies with 3+ integrations we support Narrative: Fragmentation Tax Persona: Director+ Product Campaign #2: Strategy: Highly targeted cream of the crop List:  3+ integrations  Core industry (media, marketplace, logistics, insurance) Narrative: AI, CX transformation Persona: VP+ Product, CFO, Growth, Rev Ops Signals Signal Type: Interacted with our website - Common Room Insights page view - in HubSpot Pricing page Engaged with one of our products Follows Brian, Chun, Tom on LinkedIn New hire on Product leadership team AI transformation project underway Customer experience initiative Website traffic > 20k/month Using 3+ integrations we support Attended Reforge event Recent funding Series B, C+ Priority Scoring by Signal Type: 🔥 HOT SIGNALS (Immediate Outreach): Visited pricing page New VP/CCO Customer Experience hire Job posting for Customer Insights/VoC roles Recent funding round announcement Engaged with product/demo Reforge EDU customer Referral/shared network connection 🟡 WARM SIGNALS (Priority Nurture): Downloaded content Follows founders on LinkedIn AI transformation underway Using competitor products Published content about customer insights Recent customer experience initiative CX conference speaker/attendee 🟢 BUILDING SIGNALS (Long-term Nurture): Website traffic >20k/month Using 3+ integrations Team expansion in Product International expansion High website engagement Industry match (restaurant tech, B2B SaaS, etc.) ICP Clay: 32,742 companies Industries:  Restaurant/hospitality tech, B2B SaaS for SMBs, consumer media/entertainment, logistics/marketplace platforms, creative/design tools, e-commerce platforms (using a broad set of related industry tags) Employee Count:  500–5, 000 Business Model:  Using description keywords like “platform,” “marketplace,” “multi-sided,” “B2B,” “B2B2C,” “SMB,” etc., to capture relevant models Exclusions:  Healthcare, medical, pharma, banking, insurance, utilities, government/public sector (excluded by industry tags) Geography:  Global (no country restrictions) To filter by tech – 1 credit in Clay per tech enriched Other:  No explicit filter yet for “must use 3+ of your specified tools” (this will be handled in enrichment), nor for recent layoffs/executive changes (also handled in enrichment). Requirements Accounts / Contacts in HubSpot with tag Filter out current customers / deals in play ‘Way in’ strategy for each Referrals from founder LI’s Messaging, sequences - creative hook Tech Common Room De-anon visitors to our website Snowflake Have AI write a bunch of copy for us Given enrichments in Clay",
    "full_length": 2641
  },
  "TapClicks": {
    "file": "TapClicks _ Reforge.docx",
    "text": "Renew in summer",
    "full_length": 15
  },
  "DevGrid": {
    "file": "DevGrid _ Reforge.docx",
    "text": "Goncalo Moraes - CoFounder and CTO - booked time with Chun Context LP and embedded VC They are investors of Reforge DevGrid IT outsourcing company 100 eng in Brazil Typically deal with Complex projects New ideas Founders from US & UK mainly They invest in other companies - VC funds, also give dev hours / eng for shares / cash Create this ecosystem Share tooling with their network - suggest adoption where they see benefit  They also develop a product - that’s why they came to us Early user feedback is quite key Innovation of new products Listen to new users and react fast On wednesday Demo it to two pilots Investees Cash Engineering Consultancy - advice Advice package Comes with – hey we recommend these tools Building  https://automerops.com/ Like a glove Setup himself Determine if they need to increase the tier - themes view Couple integrations - generate ticket to JIRA Survey - AI test that Next steps Evaluate with his team Get Slack channel spun up and send him pricing",
    "full_length": 985
  },
  "SAP": {
    "file": "SAP _ Reforge.docx",
    "text": "Scott  Group VP, Experiences & Design Leading eval process Context: Anything related to design Re-examining the entire flow from idea to customer feedback Efficiencies, time to market reduction Move faster to develop better and faster than previously Discovery element to that Fairly big loop Generates written assets, designs, prototypes Discovery could be Full week workshops Vs. - they have an idea Redesigning existing piece of equipment Bring in design advisors Customer feedback Post-production release Capturing / processing feedback Hand coding processes  Figma make Trying it out Two minds of it 1) When he first saw it - said, it can’t read their design system very well - but seeing designers generate fairly complex prototypes with words Wanted to eliminate the art board in Figma - hand craft something - Make is good at prototyping - not good at picking up the design system - using that as its input - extra step right now: once you’re done, have to draw it all up in Figma THEN the engineering tools can understand that  SAP compliant code 2) liked that it wasn’t picking up the design system - is that the right secondary color button? What is the intent and how does the outcome render Whats our intent? What jobs are we trying to get done for these people? Are they walking away - with evidence based results - leverage  Number of threads at SAP Success factors thread Tool experimentation Because there are gaps now in the design process - opening for someone to fill The larger team at SAP - SAP Design (dotted line connection) He runs his own design org inside success factors They are doing larger evaluations with a primary set of tools that would move to  Test environments  Insights User base is in the tens of millions daily Capture that through Qualtrics -  Asking them questions about their priorities - talking about designs - feedback on experience Ultimately trying to get to a outstanding outcome Prioritizing jobs on the regular Dovetail - SAP success factors - Smart Recruiters They are replacing their homegrown recruiting product They’ve had great success with Dovetail with really bringing elements together Next Steps Test environment - especially in the Build space Struggling with the approach at Figma - to be honest Send BUILD promo code Send custom Loom with Research, Insights, Build Do they use Slack Shareout for the team at large Send him Loom When is buying decision? How are you thinking about tool adoption? What are your main requests?",
    "full_length": 2487
  },
  "Elastic": {
    "file": "Elastic _ Reforge.docx",
    "text": "Aggregate Sources Volume Analyze Process Act Evaluation Process Other stakeholders Timing Budget 10k users sign up each month Have a feature that allows them to extend their trials after they expire Good moment to capture feedback Interested enough to keep going Ran out of time 14 day extension Minor leverage - gate that extension Could take the form of trad survey 2-3 options Fidelity increases from survey to AI interview to human interview Realistically - can’t get everyone to do human interview Before you extend - quick 5min interview Increase total number of people who are sharing dynamic feedback Already have this functionality for trial extension - add a gate in a modal experience Solve for this: Confirm that this interview is completed Initiated it - started it  Customer feedback Outreach for human interviews - done manually BigQuery - target certain users depending on research question Elastic Launched serverless product offering in 2025 Resulted in significant amount of research naturally Understand how they are engaging with it during trial and if they convert Analyze it? Record it > watch it back — AI generated interview summaries are usually accurate - sometimes miss something Transcript to a black box version Suggested reviewing it with keen attention Nuance of what someone said - exact word choice MAKE PRODUCT DECISION ON IT Take notes Consolidate notes Think about how many people are going to read them Importance of it being fully accurate 50 - 100 responses a month 5 min each 500 minutes a month Read a transcript for every submission",
    "full_length": 1575
  },
  "Muse": {
    "file": "Muse _ Reforge.docx",
    "text": "Tab 1 Current process for feedback Support team - monitoring store reviews/tickets Research team - surveys, NPS,  Not on every product - flagship ultimate muse score Monitor it Accurate Takes more time than they would like it to Usertesting Qualitative answers on deep questions Pay rewards for participating Promo code,  Limit the amount of interviews by 20 - 50 Need to know who finished these interviews  Can we auto shut off when people hit x amount 1000 rewards Today Segment, 8-12 people Small - pick up prototyping tools Emails | Set up email forwarding through Zapier Post Trial Sync Maria Research Could be used for some short voice answers Formal Quote Complex tool, need to think about how to share the bill with the support team Analysis - voluntary feedback - stores, reddit, trustpilot, etc Quality of such analysis is interesting to him",
    "full_length": 851
  },
  "Console": {
    "file": "Console _ Reforge.docx",
    "text": "Fred Kang - Head of Product Company  - Resolves IT issues / support issues Ticket automation / resolution What brings you to Reforge? 25 person startup Feedback triage Doing everything manually to date Breaking Looking for something Build it in Notion Buy something off the shelf Used ProductBoard at other companies Collect feedback automatically Categorized into features/problems with AI Be able to prioritize that into a roadmap Sources: Slack Zoom/Fathom screen recorder Could get the transcripts Volume Slack Not really tracking it Weekly: 30 things a week Interview PD process: Ad hoc Anything from hey theres a question from a customer in Slack Bigger project Depends on what it is Next Steps Flat list of themes Hierarchy - he’d like to see that The other use case Place he wants to live before Linear $15,000 for 20,000 data points 11am",
    "full_length": 846
  },
  "Rattle": {
    "file": "Rattle _ Reforge.docx",
    "text": "Context Company size:  ~70-80 employees EPD size:  15-20 Title:  Co-founder & CEO Industry:  B2B SaaS - Revenue Operations / Sales Productivity Company Context What Rattle does:  Revenue workflow automation platform that connects Salesforce/HubSpot to Slack/Teams. They help revenue teams execute processes by bringing CRM updates, alerts, and workflows into messaging apps where teams actually work. Funding:  $28.8M raised (Seed + Series A from Insight Partners, GV, Sequoia, Lightspeed India) Revenue:  $21.3M (Oct 2024) - grew from $11.7M in Nov 2023 Customers:  150+ companies including Miro, Rippling, Automattic, Gong, Clearbit, ClickUp Founded:  2020 by Sahil (CEO), Apoorva Verma (COO), Milan Singh (CTO) Pre Pitch \"Sahil, appreciate you taking the time. I know you're laser-focused on helping revenue teams execute - we do something similar for product teams. Before I tell you about us, I'm curious: with 150+ customers now, how does your product team currently stay on top of what those customers are asking for?\" How big is EPD team?  Makeup? Ai in code process? Discovery process? How do you validate product bets? -80% customer feedback based -Re-validate with customers Sources Customer calls Customer teams - come up with bunch of use cases Ping on Slack - support ticket - walk into that feature request Calls - feature request - feedback they share Priority Number of people that ask Strategic customer - higher  Based on the effort required to build that Biggest challenge in product dev First features get lots of love 2nd and 3rd - very hard to get them to work Does customer feedback play a role? Where do you collect it? What happens when you don’t? What have you done to solve this? Is this an issue today? Session replays Mixpanel LaunchDarkly Events Post Pitch Usage of AI in current product discovery process What you should know: Rattle HAS heavily invested in AI features - they have: AI Workflow Builder  - custom AI prompts to extract insights from sales calls (integrates with Gong, Chorus, Zoom) Meeting Intelligence  - automated note-taking, summaries, next steps Auto CRM updates  - AI suggests SFDC/HubSpot updates from call transcripts with one-click approval Role-specific AI summaries (AEs get pain points, SEs get technical queries, etc.) What resonates with our positioning? What does not resonate with our positioning? Have you evaluated any prototyping tools? How did that go? Are they ready to evaluate us? Why? Why not?",
    "full_length": 2465
  },
  "Petal": {
    "file": "Petal _ Reforge.docx",
    "text": "Tab 1 Product Marketing Manager User Type Feedback Sources Physicians (scheduling, billing) Product feedback, support tickets, feature requests Nurses (workforce management) Different pain points, different modules Hospital administrators Operational/ROI concerns, integration requests Health authority officials Policy/compliance feedback, reporting needs IT teams Integration issues, API feedback, security concerns Tab 2 Discovery Call Template 1. Context Setting Goal:  Understand their situation before testing the problem hypothesis Business Model \"Tell me about your business. What do you build, who do you sell to, what's your go-to-market like?\" Listening for:  B2B vs B2C, complexity, whether they have direct customer access Their Role + Team Structure \"What's your role, and how is your product/discovery team structured?\" \"How many people on product vs. engineering?\" \"Do you have dedicated researchers, or is discovery part of PM work?\" Listening for:  Resource constraints, maturity level, whether discovery is professionalized AI Maturity \"Are you using AI tools in your engineering workflow? (Cursor, Claude Code, etc.)\" \"How much has that changed your shipping velocity?\" Listening for:  Do they actually have the gap? (Fast eng without fast discovery only matters if they've accelerated eng) 2. Process Goal:  Understand how discovery actually works for them, not how it should work Current Discovery Process \"Walk me through what happens from idea to 'ready to build.' What does that actually look like?\" Let them describe it end-to-end without interrupting. Listening for: Manual:  Are they doing things by hand that could be automated? (Scheduling calls, pulling data, compiling feedback) Fragmented:  Are they bouncing between tools? (Slack, Figma, Notion, spreadsheets, Amplitude) Limited resources:  Are they bottlenecked on researcher time, PM time, customer access? Multiple products:  Are they validating one direction at a time, or exploring multiple? Time sinks:  Where do they lose weeks? (Research scheduling, synthesis, stakeholder alignment) Specificity Check \"Can you walk me through a recent feature? From initial idea to launch, how long did that take and what did the discovery process actually look like?\" Listening for:  Real friction points, not abstract ones What's Bottlenecking Them \"In that process, where do you lose the most time?\" \"Is it scheduling customer calls, synthesizing feedback, exploring options, getting stakeholder alignment, or something else?\" 3. Consequences Goal:  Understand the actual cost of poor discovery for them What Happens When You Don't Validate \"What happens if you ship something without proper validation?\" Let them answer first. Don't lead. Listening for: Speed/rework:  Do features get re-scoped mid-build or after launch? Time cost:  How much eng time goes to fixing vs. building new? Adoption/retention:  Do features underperform? Can they measure it? Churn:  Do customers get frustrated with poorly thought-out feature",
    "full_length": 5278
  },
  "AE Strategy _ Claude": {
    "file": "AE Strategy _ Claude _ Reforge.docx",
    "text": "Strategic Sales Playbook for Reforge Insights From acquisition to acceleration: Your roadmap to exceeding targets Reforge's January 2025 acquisition of Monterey AI positions the company at the intersection of AI-powered analytics and customer feedback intelligence. With internal data showing a 27.8% win rate across 180 deals and $2.4M in total pipeline, this playbook synthesizes comprehensive market research with proven sales patterns to accelerate your success as a new Account Executive. The strategic opportunity you're stepping into The customer feedback analytics market presents an exceptional growth opportunity, with the total addressable market reaching  $14.82 billion in 2025 and projected to hit $35.37 billion by 2030  at a 19% compound annual growth rate. More importantly,  70% of CX leaders plan to integrate generative AI into their customer touchpoints by 2026 , creating urgent demand for AI-powered feedback solutions. This timing coincides perfectly with Reforge's strategic expansion through the Monterey AI acquisition. Brian Balfour, Reforge's founder and CEO, identified what he calls the \"Feedback Fragmentation Tax\" - a critical problem where product teams collect vast amounts of qualitative customer data scattered across 10+ tools, leading to wasted time, poor product decisions, and technical debt. This pain point resonates strongly in the market, as evidenced by  Garry Tan, President of Y Combinator, declaring that \"Every PM and CEO should use @montereyai\"  and calling it \"truly essential product analytics.\" The solution aggregates scattered feedback sources, applies AI-powered analysis to surface unique opportunities, and delivers insights directly into existing team workflows through integrations with Jira, Slack, Notion, and 20+ other platforms. Your internal sales data reveals important patterns to leverage. The  44.4% win rate for small deals ($0-5K)  significantly outperforms the 20.4% rate for medium deals and 34.1% for large deals, suggesting a land-and-expand strategy could be highly effective. Additionally, Brian Balfour's personal involvement correlates with a 34.1% win rate across 41 deals, indicating the power of executive engagement, while the NY Times' 100% win rate demonstrates strong enterprise potential when properly positioned. Your competitive positioning advantage The competitive landscape analysis reveals clear differentiation opportunities against established players.  ProductBoard charges $59-75 per maker per month  with AI features costing an additional $20 per user, while their enterprise deals often reach $70,000-100,000 annually. In contrast, Reforge Insights offers  unlimited user seats with consumption-based pricing , eliminating the per-seat penalty that makes competitors increasingly expensive as organizations grow. This becomes a powerful differentiator when speaking with growing companies concerned about scaling costs. Against Enterpret, which also offers unlimited users and custom AI models, Refor",
    "full_length": 12122
  },
  "Exus": {
    "file": "Exus _ Reforge.docx",
    "text": "Maria - Product Manager Konstantinos -  Greece Exus Debt collection industry Collections Their clients also from different countries around the world Middle east, Southeast Asia, America, EU 40+ clients around the world Base in Greece In reality, employees all over the world 18 different nationalities Greece, Lebanon, Latin America Asia, Africa They both represent the product management team Maria | Chief Product Officer Main reason: She is new in this role / department What can they do to make the team more efficient  Tools, processes, all that Tools for product management Using a tool for prototyping which is quite good - VZero - Figma Trigger point: Have some companies that are consultants for their product - use a platform where they could have the roadmap and make it available - exchange customers They can submit ideas through Jira Product Strategy Combination of things They are both new Current process (DOESNT LIKE THIS): RFP process Customer submits a RFP Use these questions / requirements as input for what is happening within the market Not always very clear - find patterns Last month Collaboration framework with a few customers - most important ones End goal: Build product discovery process For the moment, discuss with them some ideas they already have From their side, they come to them with their roadmap  See if they are in the right direction More high level strategy — follow the sales/marketing strategy “We intend to expand in Canada, US, etc >> see – based on what they know – are they doing well for these markets, etc” Competition: don’t have everything  AI - market trends - monitor closely Find a ideal use case Internally CS team, people who help new clients to install and setup their application Feedback from internal teams is hard More so get recommendations from the internal team Support tickets Mainly technical issues Never seen a nice ticket with a nice use case Tool Collect feedback, organize it under roadmap items THEY ARE ONE STEP BEHIND - haven’t built the proper feedback yet SO they can analyze it End Clients Enterprise Debt Collections Legal Recoveries Decision Analytics Self Service Collections Field Collections NEXT UP: More information on educational courses Product Team 7-8 people",
    "full_length": 2248
  },
  "Halth": {
    "file": "Halth _ Reforge.docx",
    "text": "Supabase Intercom Outbound/Inbound/Support Canny Internal and external feedback Helps plan roadmap Lovable website Stack for platform Intercom embedded everywhere Use Notion for all of their  Intercom 500 a month Intercom Some providers are on Slack Record calls Product led growth - don’t do a lot of calls Segment Prototyping? Just to start Getting some sort of feedback to them",
    "full_length": 380
  },
  "DemandFarm": {
    "file": "DemandFarm _ Reforge.docx",
    "text": "Website Putting competitive program in place Launching new product See a lot of competition in their space right now Reforge Familiar with it Org people have taken courses here and there Competitive program 70 competitors in the space Lots of very small, minor ones First round - 7-8 competitors Goal: Help product teams make better roadmap decisions How do you make decisions today? Some amount of research - Product does its own research Intel - AI tools Customer feedback Mostly from top customers - the happy ones What kind of feature requests are they getting? ONLY HELPS TO KEEP THEM HAPPY NOT GETTING ENOUGH INTEL TO INNOVATE FASTER MAKE BIGGER BETS - CS INPUTS ISN’T GIVING THEM THIS Sources of feedback Couple of ways Basic win/loss analysis - interview - do it for all customers CSAT / NPS - customer health score Any big requirements that come in - have some big logos Prioritize them, but not sure thats the right way Sweet Spot Goal Competitor: Are they building something new? Volume of data per month Gong — count of insights Run analysis on all calls they have Timeframe  Historical | weekly - 30-35 calls Volume Small cohort of data | 5-8 calls a week | have some surveys they run | surveys are quarterly  Top level number  Budget: $10,000 - $15,000  Is it worth investing in tools  Select what data points they sync Syncing all wouldn’t make sense Trial Just need some resources Needs to get buy-in from a few people If they buy Some internal documents Explanations What is process Basic requirements - kind of insights its giving them - get certain level of insights Able to categorize them Once they have buy-in, PM team How do they deploy, how long does it take Have a RevOps person who was tinkering with trying to create these workflows in house Can’t delay the CI program Based in India AHHN GEE R(roll) AS Next Set up trial and slack, invite him Send resources to help with onboarding Get first cohort in Get full volume from him, get quote",
    "full_length": 1965
  },
  "Infragistics _ SlingShot": {
    "file": "Infragistics _ SlingShot _ Reforge.docx",
    "text": "Nick - involved in learning for years Advising a company Infragistics Intercom Pendo Volume Infragistics Slingshot is new Reveal product - tens of millions UI/UX tool Product Team - other products Slingshot Public beta Because the business has been a MS Gold partner for decades Dev process is antiquated Ship way too slow Reveal is up against MS BI and other majorplayers Can’t shift fast enough to compete Have a distribution model - cant and wont last forever -Work on getting him in Beta / Build -Run insights in parallel Need a better feedback loop for other products Narrative Legacy companies Speed to production is faster CEO No1 priority  Just got brought in a month ago - he was a client of his a whale ago - SEO client 2 years - set it up Spent $15million on it Project management tool - dashboard tool  He was building for developers before PM tool now, devs dn’t use it Having a really hard time understanding the lack of success Define ICP Data analysts People who build dashboards Laser focused on ‘hobs to be fone’ Thorn in his side No ICP NEXT: Advisor at a huge company (Infragistics) They have a new product (Slingshot) and two existing products that have millions of users CEO is old school but dumping a bunch of money into growing this new product Nick is going to co-sell with me Build use case: Ship product faster Research use case: Collect feedback from their new product launch IA: Aggregate data across all sources (Intercom + – but he has to check) - analyze",
    "full_length": 1487
  },
  "MYOB": {
    "file": "MYOB _ Reforge.docx",
    "text": "Business software - accounting focus Simon head of AI Products What data are you using to drive decisions Tried to liberate that from silos When product people bring him roadmaps - ‘what number did you get that from’ Product, revenue, application data — all into one place One thing that always bugged him was voice of customer Two major problems Volume problem - who’s going to read all the support tickets Bias problem Looked at Twine, Reforge Insights - some other stuff Gathering the data - grouping/classifying the data At the end of the day First bar: Grouping of interesting opportunities for a PM So they can go wide Not just noise > just signal When they click in 6+ First requirement Data security box ticked Set up project with Research team Cohort to send to Trust Center Security Docs",
    "full_length": 797
  },
  "Albert Invent": {
    "file": "Albert Invent _ Reforge.docx",
    "text": "Tab 1 Quick recap of what she like liked: Plan/Ask mode for early discovery structuring, high-quality clickable prototypes. Also nice that up-front work which produces better outputs can help reduce credit cost. Inthe next few weeks we'll be leaning HARD into plan mode, making that a primary means for interacting with the product. Team/credit model (pooled credits, editor/viewer roles, predictable usage) We're going to be set up for this with teams launch Easy capture of feedback (i.e. commenting pinned to elements of the prototype) Improvements planned but TBD on timing What she wanted: Some form of component/design-system capability This is still TBD - we're evaluating this for an extension feature Additional lightweight heuristic evaluation of early prototypes. Planned for plan mode improvements Possibility for prototypes that can be handed to another coding agent later. (e.g exporting structured specs/context for engineers or their coding agents.) This is in planning mode - we are working on handoff capability sometime in Q1 Possibility of exporting to Figma for production design. This is lower priority but we are looking at different integrations Tab 2 Head of UX - Ityam Team size? Adam Green Call Key Discussion Points: 1. Company Overview: Ityam Deshpande from Albert Invent, a pre-series B startup (128 employees) in chemical and material science, leads a design team of 4, growing to 5-10, and a similar-sized PM team. 2. AI Initiative Goal: Ityam is spearheading an initiative to integrate AI tools into their end-to-end design process, moving from ad-hoc explorations to a structured approach for efficiency. 3. Four Key Phases for AI Integration: The initiative focuses on Discovery/Problem Validation, Design Iterations/Prototyping, Documentation/Handoff (especially Figma plugins for niche content and annotations), and User Research (quantitative usability testing, qualitative interviews, heuristic evaluation). 4. Build's Differentiator: Adam Green highlights Build's use of Cloud Code as its coding agent, which is superior for reliability and context chunking compared to custom agents used by competitors like Figma Make and Alloy, though it might be slightly slower initially. 5. Credit Usage Optimization: Build recently rebalanced credit usage, making actions 5-10x cheaper, especially follow-up prompts, and optimized initial extension interactions to reduce cost. 6. Team Features & Credit Sharing: Build is launching team features in Q1, allowing pooled credits and role-based permissions (editor vs. viewer) to manage usage, with viewers still having free credits for basic interaction. 7. Roadmap for Planning/Chat Mode: Build plans to introduce a more chat-based \"ask mode\" for reasoning and discussion before code generation, which will be much cheaper in terms of credit cost. 8. Design System Integration: Build is evaluating two directions for component libraries: an internal system capturing DOM elements or integration with external sources like",
    "full_length": 8158
  },
  "Adobe": {
    "file": "Adobe _ Reforge.docx",
    "text": "Wanda Jen Jones",
    "full_length": 15
  },
  "Manara Tech": {
    "file": "Manara Tech _ Reforge.docx",
    "text": "Tab 1 Reforge Research He did it earlier in the day yesterday Stood out to him Gave it ‘not too detailed of a view’ Couple paragraphs Modeled it after one of the roles they are looking to hire for Role: More strategic, more senior - less IC work What he got out of it: Two core issues Questions it asked were pretty superficial (followups?) Questions were VERY specific (what about this, what about that?) Fundamentally – did not understand what his goal for the interview was about For example: Looking for someone who understands ‘this type of strategy’ can do work in ‘this kind of space’ Tell me what you think about strategy? – was a question Problem #1: Construction Prompt to interview topics Can we put specific questions in? 2nd piece: Tech perspective Not sure what drives this difference He found that the ‘pauses’ in the interviewer were too long – he was worried it crashed Gave him space to answer question — most of the time, he would stop talking, it would pause and pause and pause Indicator that it is thinking / processing Prompt to topics He did try to click on those and see if he could expand it Couldn't tell that they were editable Pauses – too long They built their own AI interview tool For more junior people For people to practice the process of interviewing Use Case: Curiosity, what's the state of the art? They have a normal business EDU license with us They – for a long time - have used some non human in the loop step in the beginning of their hiring practices Lots of hiring around the world By pulling out the human being there Used to use a tool called ‘MyInterview’ – just — here’s a set of prompts, person records their answer — scan through for social skills, english skills – no analysis If it's good enough where the candidate can have a conversation with it - thats great Volume Back when they were using MyInterview – one year it was 25,000 Slightly different purpose than for recruiting now For recruiting per year Couple hundred a year Ideally its all in English - maintain that as part of their work culture Even for people who end up being good candidates - sometimes their skills are weak enough - false negatives with people Killer feature for him: If we could Ensure that a certain topic gets discussed in the series of questions Please make sure that it asks about strategy for appealing to Enterprise clients People want more control over what is said  Tab 2 Background Team:  Teal (Product Ops) and Don (Director of Product) Context:  Evaluating prototyping tools for 2026 planning. Currently use Figma Make, custom GPTs; some exposure to Lovable. Pain Points: Tool-jumping between PRDs, prototypes, and AI tools. Figma prototypes don’t follow design systems or feel interactive. Need faster idea-to-prototype workflows without designer dependency. Desire for PRDs and prototypes to stay in sync automatically. Evaluation Focus Quick, believable prototypes that use existing design components. Ability to ingest Relias’ design system (Angular/mat",
    "full_length": 3614
  },
  "Lyvena": {
    "file": "Lyvena _ Reforge.docx",
    "text": "Prior interest in IA Came in from Build",
    "full_length": 39
  },
  "Diagnostic Measurement": {
    "file": "Diagnostic Measurement _ Reforge.docx",
    "text": "Career marketing researcher Own and run a boutique agency 8 years Clients are fortune 500 companies Mgmt consulting PE Would be remiss if he Majority of work he does for them Survey research To their own customer list Primarily external market US and abroad Market sizing How do you find them research participants? Works through a small group of B2B panels Pretty choosy on those Don’t use cheap sample",
    "full_length": 403
  },
  "IZI": {
    "file": "IZI _ Reforge.docx",
    "text": "What brought them here? Person CEO Humberto Leticia Team Size (Product 2-10) Business Timing Urgency Customer Voice Strategy + Impact —---------------------------------------------------------------------------------------------------------------------------- Aggregate How much? Channels? Analyze Act —----------------------------------------------------------------------------------------------------------------------------",
    "full_length": 427
  },
  "Natalia Avdeeva": {
    "file": "Natalia Avdeeva _ Reforge.docx",
    "text": "Member for a long time",
    "full_length": 22
  },
  "HakuApp": {
    "file": "HakuApp _ Reforge.docx",
    "text": "Tab 1 Website Right now the majority of feedback is funneling though CX into productboard ~280 tickets per month (an entirely separate problem). But we collect data from ZenDesk, Gong, Surveys as well. Ideally, future state in-platform and mashed up with quant platform data. Our aim is to gather more passive data, have direct customer input and eliminate CX as an intermediary.  HAKU Event management for endurance events Ironman Signup, relationship management for organizer Nonprofits SUPPORT TEAM Handle all participant support for client base So the client isn’t managing the one-off NO client support channel - all funnels through support reps ANALYZING CUSTOMERS BUSINESS Dont want to ignore that Scenario where they analyze feedback from participants Distinct way to manage that PRODUCTBOARD NEED: Customers enter feedback - Interviewer Feedback Customer Account Internal Sources ZenDesk - Participant support - no general inbox for customers Gong - Sales + CS Surveys Not many of them New marketing function - been here for a year - exploring Qualtrics for that SurveyMonkey Productboard? External Sources? App Store? - no mobile data Competitive Data? Event space Nonprofit space They make money on fundraising - transaction business There are unique competitors for endurance and nonprofit Endurance | Lets Do It + Run Signup  Nonprofit | Give Lively, Give Butter, GoFundMe Anna Joined about a month and a half ago Significant gaps in data analytics Customer data - lots of it - all over the place Funneled through ProductBoard CHALLENGES All put through this filter of CX, their perspective Volume One whole employee is triaging this every day Not ideal, not sustainable Symptomatic of some other operational things they have Even if they reduce the volume – still a lot of data Looking for  UNDERSTAND HOW CUSTOMERS ARE FEELING Product Strategy Marketing team TIMING Working on getting processes organized Includes an overhaul of team structure, launch at beginning of 2026 Feedback replacement solution | in place by Jan Analytics solution MixPanel - but only implemented for data analytics CRM HubSpot PATHWAY IN Ad on Instagram Took a look at related products for that 20,000 Data Points in ProductBoard ZenDesk -  Gong - Sales/CX calls  Recommend new customers handling old data Trends / Themes in clients client data improve registration process, error messaging, etc NEXT: Send her 5min recordings Couple other people | Director Of Marketing Reply to the invite / send it to her Tab 2 Feedback Metadata: metadata that is tied to a specific feedback item, such as the version of the app of an iOS review Customer Metadata: metadata that tied to the customer providing feedback, such as a job title, username, or tracked user-event Account Metadata: metadata that is tied to the overarching account of a group of customers, such as an account contract value Challenges Time Tax Translation Tax Trust Technical Debt",
    "full_length": 2932
  },
  "Opus2": {
    "file": "Opus2 _ Reforge.docx",
    "text": "Product Discovery Agent Sunny Sood Principal Product Manager Moved up the ranks In charge of 3 different products Looking for AI opportunities in all of them New features will bring How do we introduce AI Writing up workshops - articulate nuances Team 3 principal PMs like Sunny 2 PMs a level below Beyond that - people who do related product work - not on product side Business impact / market No1 provider of the service they provide Hearings, arbitration,  Proof of concept, test, go from there They have SME users in legal space Consult with them Play with some data Lots of the hearings are public domain Devs - still pretty new in  Use CSAT Ask about the quality of the service we provide - not the tech they provide 2 week tria At this stage almost any intel is useful as everything in that doc is a hypothesis at this point.  Probably the most useful are things around the problem / pain / enemy vs the solution (since that is changing massively).  So things like: Does the problem resonate?  Why or why not?  When and when not?  Where does it live on their priority stack? Are there specific discovery questions that yield more valuable info than others? Are there pains/consequences the ICP is thinking about that aren't listed? 500 credits Haven’t tried importing from Figma yet Will play a big role quite soon Depends how scientific you want to be Narrow the scope of what you think success is Ex: During a hearing - how they might query / use AI - in real time a witness someone said in a hearing vs. all docs we have against them LOTS OF COST TO BUILD THAT To verify that, minimize cost of testing Once thats proven, getting that approved immediately by exec team He has a direct line Decision paralysis Hes making the decision by proxy - strong recommendation Heres what we tested Criteria for success He wants to get analytics across all products",
    "full_length": 1862
  },
  "Enel _ Reforge(1).docx": {
    "file": "Enel _ Reforge(1).docx",
    "text": "Context Source: http://app.mtbecosystem.com/ Inbound - Research lead Meeting date: 11/6 Email in: Prospect Analysis PROSPECT SCORE: B+ (Good Fit - Worth Pursuing with Strategic Context) CRITICAL CONTEXT: THIS IS AN INBOUND OPPORTUNITY This analysis reveals a  unique situation : ENEL has already  self-identified their need  for a \"Qual at Scale\" research platform through Mind the Bridge/your referral partner Giorgos. The attached document IS their internal RFP specification for exactly the type of AI-powered feedback analytics solution that Reforge Insights provides. This fundamentally changes the opportunity dynamics: They're actively shopping for solutions (immediate buying window) Budget is allocated for innovation project testing Technical requirements are documented and match your capabilities Decision-makers (Customer Lab team) are engaged Timeline is compressed (meeting scheduled Nov 6, 2025) KEY FINDINGS: 1. ENTERPRISE VOLUME OVERWHELM (HIGH PRIORITY QUALIFICATION) Massive Customer Feedback Volume: 72+ million end users worldwide  (54.9M electricity, 6.2M gas customers) 60,000+ employees  generating internal feedback Operations across  34 countries  on 5 continents Multiple business lines: generation, distribution, retail, renewables 32+ million smart meters  deployed (real-time customer data streams) Volume Calculation (Conservative): 72M customers × even 0.1% monthly contact rate =  72,000+ customer touchpoints/month With 10x transcript multiplier =  720,000+ data points monthly minimum Reality likely 5-10x higher given utility industry complaint/support volumes 2. MULTI-SIDED PLATFORM COMPLEXITY Diverse User Types Creating Feedback Fragmentation: B2C Retail customers  (residential electricity/gas) B2B Commercial & Industrial clients  (energy solutions) B2G Government partnerships  (smart city projects) Landowners  (renewable energy site leasing - \"hundreds across rural America\") Distribution partners and agents  across 34 countries Internal stakeholders  across multiple business units 3. EXPLICIT PAIN POINT: QUAL AT SCALE NEED From Their Own RFP Document: Currently use \"qualitative OR quantitative research tools\" separately Need to \"overcome current limitations and embrace Qual at Scale methodologies\" Processing \"large volumes of open-ended and structured data\" Manual analysis impossible at current scale Want \"automated coding of qualitative data at scale\" Need to \"detect weak signals and emerging trends\" Require \"real-time or near-real-time insight generation\" This is a PERFECT match for Reforge Insights core value proposition. 4. TECHNOLOGY READINESS (EXCELLENT) Sophisticated Technology Stack: AI/ML initiatives actively underway  (documented in Customer Lab innovation projects) Cloud-native infrastructure (SaaS preference stated) Smart grid/IoT technology leader (32M+ smart meters) API-first approach (integration capabilities mentioned) Data analytics culture (Customer Insights team, Innovation Labs) Partnership with  Cisco CX Cloud  ",
    "full_length": 11867
  },
  "Vivaldi": {
    "file": "Vivaldi _ Reforge.docx",
    "text": "Partner, Head of Latin America Global Consulting Firm - innovation/transformation Over past years - experience in defining growth strategies for their clients Innovation portfolio Early prototypes to test Moving prototypes to high fidelity Very familiar with Reforge Do you use a prototyping tool today? He’s used Lovable Not today at Vivaldi - mostly designers / freelance Most work is growth strategy / innovation Prototypes to test digital services Extended network of freelancers Want to extend their capabilities Net new solutions Don’t do tweaking of existing products More so new products – adjacent Accelerate the way they bring those to life Innovation Pipeline Test new concepts How do you validate? Depends on the type of project Define a growth strategy Define platforms Look at potential opportunities that the company is competing in Qual research / quant research Test those concepts Growth Strategy innovation project Pipeline of concepts they want to test Dont get hired for product Get hired for strategic roadmaps / playbooks Next Insights + Build followup They have a unique model where they can bring this into companies who need growth done White label / partner play?",
    "full_length": 1190
  },
  "JustAnswer": {
    "file": "JustAnswer _ Reforge.docx",
    "text": "Team of Product people Excited to learn  Product Team: 30-35 people Split into a couple divisions Collecting feedback today Surveys as much as they can Teams do it in a slightly different way No centralized Hub where they store it Can take a lot of time to do the research What are some of the challenges you’re having today? Collecting and storing Insights somewhat well Have tools that they can use to enter  Feedback is very fractured Stored in different places Directional data Next Steps from here Debrief with the group Followup qs Maybe run some tests in areas Notes Multi language support - Japanese, German, Spanish Volume for feedback",
    "full_length": 644
  },
  "Pocket FM": {
    "file": "Pocket FM _ Reforge.docx",
    "text": "Tab 1 Insights tool Background Dir of Product - Nishad Pocket FM Largest consumer companies in India 22 million MAU Discovery process Broadly a mix of data and research Have a lot of dashboards internally What are users doing in the product What are major gaps on content they are consuming User journeys that are working well or not Also have user research team, do surveys/interviews - test hypothesis Example Realized - thriller content genre - not represented well in platform Deploy user research team Engage with current users Try to get insights from them Qualitative heavy Quantitative Research team does a lot of interviews Transcribed He does summary Stack In app surveys Interviews App store and Play reviews What could be improved Want to see how they can get product velocity faster Time from idea to fully formed feature takes much longer than it should Questions At scale, the data doesn’t change that frequently New feature - more subjective reviews Quarter to quarter roadmaps Quantitative Geography - page less conversions Connected a survey for that page Next Steps Budget Timeline Data volume much higher Surveys Transcripts App store reviews Google Play reviews How long does it take to set up? Directionally it looks close to what they are looking for",
    "full_length": 1273
  },
  "DataDrew": {
    "file": "DataDrew _ Reforge.docx",
    "text": "Vineet - PM Prototypes AI analytics Ship products faster Process today Currently - use other products - Bolt / Lovable Looking at alternatives Reforge Optimize onboarding / activation flow Better engagement with the product Discovery Process Small feedback button in the product Intercom from users User interviews on Gmail / GMeet - track those notes in Granola Offline meetings This stage Don’t have a lot of feedback from the users Building ask AI analytics on Shopify, G4 Play Trial - IA Start with Research - trial of Build for Teams Total team: 2-3 people Also want to look at Reforge insights in 10-15 days Be done with prototype by tomorrow",
    "full_length": 648
  },
  "Transfr": {
    "file": "Transfr _ Reforge.docx",
    "text": "Pendo - replace with in house analytics tool NPS surveys Interested in survey offering Company Utilize VR for training Complicated tool set B2B2C biz model End users Pendo Hodgepodge tool Does 3 things - do none of them perfectly - none of them individually well Analytics Ad hoc surveys Logges into web product Pendo  CS team loves it - can see it in slack Guides Surveys + Guides — two different toolsets 500 responses last 180 days Analysis Data warehouse that pulls that in alongside other data points Pendo only sees web - doesn’t see VR",
    "full_length": 542
  },
  "LakeView": {
    "file": "LakeView _ Reforge.docx",
    "text": "Get feedback Analyze it Customer journey through the site - tracking is in place Bayview | Mothership Underneath | Set of Lakeview sister companies Insurance Real Estate Sub division he works for Lakeview Digital In house product team Design / Product Engineering Build the most dynamic customer engagement website / dashboard that the company has Also a ton of other companies Not all need customer facing things Similar platform MixPanel Culture Amp (internal) Salesforce Lakeview | Different tech stack Most websites for LakeView are using WordPress Interesting Use Case Something pops up Would you like to share your feedback with us? They say yes Next q: What would you like to give us feedback about AI would then generate questions for them - based on the topic they asked for The other Use Case Do you want to help us improve experience? Click this link, share with us Next: Get him using Research Possible IA deal - said he has to talk to his manager about that",
    "full_length": 970
  },
  "Betr": {
    "file": "Betr _ Reforge.docx",
    "text": "Tab 1 Claude Prospect Analysis Primary User Types Generating Feedback: Sports Bettors  (Sportsbook users) Bet placement experience Cash-out functionality feedback Odds/line complaints Payment processing issues Responsible gaming concerns Social Gamers  (Betr Picks users) Game mechanics feedback Leaderboard/competition experience Social features usage Prize/reward fulfillment Onboarding experience Cross-Platform Users  (using both products) Account management across products Cross-product promotions/bonuses Unified wallet/payment experience Regulatory/Compliance Feedback Age verification issues Geolocation problems Responsible gaming tool usage Withdrawal/deposit compliance Their Process BETR DISCOVERY CALL QUESTIONS Contact: Vishal Korlipara, Head of Acquisition Date: [Your Date] Prep Notes: Focus on CAC optimization, activation rates, early churn signals, channel attribution ═══════════════════════════════════════════════════════════════════════════════ OPENING (2-3 MIN) \"Hey Vishal, thanks for jumping on. I work with platforms like Underdog Fantasy on a challenge that's probably top of mind for you as Head of Acquisition - you're spending serious money to acquire users in a competitive market, but once they're in the door, understanding WHY they activate or churn is probably scattered across a dozen different touchpoints. Here's what I'd love to do in the next 30 minutes: - Understand how you're currently connecting acquisition data to customer feedback - Share what Underdog's acquisition team is doing to reduce CAC and improve activation - If it makes sense, explore what this could look like for Betr Sound good?\" [GET AGREEMENT] ═══════════════════════════════════════════════════════════════════════════════ SECTION 1: ACQUISITION → RETENTION CONNECTION (8-10 MIN) Q1: Walk me through your user journey from acquisition to first bet/pick - at what points are you collecting feedback, and how does that inform your acquisition strategy? [LISTEN FOR: Gap between acquisition metrics and qualitative feedback, disconnected systems] [NOTES:] Q2: When a cohort of users churns in their first 30 days, what's your process for understanding why? How do you connect that back to the acquisition channel or messaging that brought them in? [LISTEN FOR: Manual processes, time delays, inability to attribute feedback to channels] [NOTES:] Q3: You're running acquisition across both Sportsbook and Betr Picks - how do you think about which product experience drives better retention, and how does feedback play into that decision? [LISTEN FOR: Cross-product insights challenges, siloed feedback, attribution difficulties] [NOTES:] ═══════════════════════════════════════════════════════════════════════════════ SECTION 2: CAC & ROI (5-7 MIN) Q4: What's your biggest lever for reducing CAC right now - is it conversion rate optimization, better targeting, improving activation rates, or something else? [LISTEN FOR: Where he's focused = where you position value, current priorities",
    "full_length": 12009
  },
  "Almabase": {
    "file": "Almabase _ Reforge.docx",
    "text": "Context Almabase Platform Structure:  B2B SaaS platform serving educational institutions (alumni relations, fundraising, events, mentorship) Multi-Sided User Analysis: Platform Clients:  Universities, colleges, schools (institutional admins) End Users - Alumni:  Graduates engaging with alma mater End Users - Students:  Current students using mentorship/networking features End Users - Donors:  Financial contributors across giving programs End Users - Event Participants:  Attendees at reunions, networking events Administrators:  Advancement office staff, fundraising teams Ginu George Head of Product & Design Stack HubSpot, Intercom, Segment Context L&D budgets Couldn’t afford it in the past Budget still a topic Team size: 6-7 seats over the course of the year - have a 10 seat version 4-5 to start, add-on a few Line up cost for that before end of year What would this mean for his team itself - analytics for him - how are they improving Business Impact Evaluation Process Timing Competitors Next Steps",
    "full_length": 1011
  },
  "OLX": {
    "file": "OLX _ Reforge.docx",
    "text": "OLX Insights Update We were the winners but... They just formed a new \"AI Division,\" Chief Data Officer and someone from finance came in last second, they are now pushing on why it can't be built in house.  Sounds like politics...the new AI division needs to justify their existence.  Joao has no idea how long it will take to get to a final/final decision.  At best, there is no way this is done this year.  Next steps: Keep data in the workspace, I'm going to remove all users except for those evaluating Reforge Research @Chun Jiang  have you ever put together a build vs buy set of info for a customer? @Jonathan Greenberg  the evaluation of Research is separate.  He said he's been hearing good things from his team.  AWS Redshift - custom table that syncs to Insights Next Steps Onboarding/Support Dependencies Pricing No Surprises ‘We can include terms like - we won’t go over the data limit unless we get something in writing’ Rough projections - if we go over by x percent 1 year contract is important Are you trying to get to a decision on this on a certain timeline There is ‘pressure’ to do this Hoping to land on decision before Christmas Decision on build vs. buy in Jan WHAT DOES PROCUREMENT LOOK LIKE? Fiscal year ends March 31st They’d like to start the new fiscal year - April 1st, conversations / finalizing contracts - needs to happen before the new fiscal year starts At least 3 weeks for the procurement aspect Followups Send some templates we use to guide onboarding More confident estimates in how we think about work from their side - data eng Pricing Estimate",
    "full_length": 1585
  },
  "Brigit": {
    "file": "Brigit _ Reforge.docx",
    "text": "1/26 Context Setting Going through a big transformation Looking to improve their User Research practices Feel laborious - scheduling - people not showing up Business: Consumer fintech Get cash now Earned wage loan company Once they know they have income - bit of cash prior to paycheck Lot of people who are in distress, money concerns, don’t talk about money Creates this conundrum researching this issue - users don’t want to talk about money in general Timing is hard to nail down VERY IMPORTANT Concept testing Really understanding what is the current experience vs. what can it be? 2 million+ members generating massive feedback volume Multiple product lines (cash advances, credit building, budgeting, income tracking) High-frequency user interactions (daily financial app usage) Types of feedback: Support tickets from financial issues App reviews and ratings In-app feedback on features Customer success conversations Compliance/regulatory feedback Credit building program feedback Payment issue complaints Role:  Team Structure: AI Maturity: \"Are you using AI tools in your engineering workflow? (Cursor, Claude Code, etc.)\" \"How much has that changed your shipping velocity?\" Process \"Walk me through what happens from idea to 'ready to build.' What does that actually look like?\" Feedback channels: They do surveys, calls - BIASED, too incentivized Maze - prototype testing - usability testing Userlytics - little bit of unmoderated user testing for non users Dovetail - to collect this research Most of the time Use DoveTail for their AI synthesis Clips, making reels Marketing team sends out surveys - sends out those results Highly incentivized People answering for what we want to hear ‘Would you date someone who had debt?” - Marketing SHE WANTS TO BRIDGE THE GAP FOR ALL OF THEIR RESEARCH VERY SILOED Consequences \"What happens if you ship something without proper validation?\" Low adoption to some of the secondary features they’ve had People come for line of credit Subscription Credit builder Credit monitoring Budget builder THEY ARENT USED PEOPLE DONT UNDERSTAND WHAT THEY ARE Solution \"Are you actively trying to solve this problem right now?\" \"What's your plan? (Hire more researchers, new tools, process changes, etc.)\" Timing \"How urgent is this? When would you want to move on it?\" \"What's driving that timeline?\" How big is the team: 3 designers - actively hiring  End of the day - dozen or so Disco Discovery Call Template 1. Context Setting Goal:  Understand their situation before testing the problem hypothesis Business Model \"Tell me about your business. What do you build, who do you sell to, what's your go-to-market like?\" Listening for:  B2B vs B2C, complexity, whether they have direct customer access Their Role + Team Structure \"What's your role, and how is your product/discovery team structured?\" \"How many people on product vs. engineering?\" \"Do you have dedicated researchers, or is discovery part of PM work?\" Listening for:  Resource constraints, maturit",
    "full_length": 6893
  },
  "Maestro": {
    "file": "Maestro _ Reforge.docx",
    "text": "Company: Maestro Size: 27 employees EPD breakdown: Contact:  Industry:  Customer profile:  PD current state: Using AI in discovery? In code? Future state: Budget, Timing, Process Next steps; Prashant - CEO Adrian -  Enterprise SaaS Delivering AI features to their clients Also - investigating what tools/platfrms can help in process Lean team 1 designer (Enrique) 1 PM Scale their efforts Product Discovery: Traditional process ID a problem / opp Speak to internal CS team, what they know Speak to clients - what outcomes they want Insights from the research - ideate on those insights Prototype for clients, validate, iterate Challenge Process yields well, pretty efficient Prasanth would love for us to be quicker Any velocity they can gain - the better Speed - hands off with validation and research Prasanth: Caught his interest - there is often this wireframing to higher fidelity designs to getting feedback - time consuming Times they are bringing a dev to build some proof of concepts to communicate solution – fairly costly Enviriosning:  Is there a world in which the PM / Designer could create  Loosely coupled prototypes - new workflows - in the product Maybe its not all tied up yet - not shippable code Get the feedback - without bringing developer into mix Demoware Build from existing context: Any prototyping today: What is important to Prashant\\ Value props Prototype from existing product Storybook integration Platform for housing their coded component Can we use prebuilt components Prasanth As soon as possible $20k $40/user/month Deeper demo focused on Build - how does it get those prototypes built in a way where it looks and feels like Maestro How does that unlock execution speed for Enrique and Bobby  Next Steps Demo + Pilot next week Enrique to send Figma file - me to set up the account with context Me to set up list of ‘success’ in pilot KEY: Can they build prototypes without paying a developer?",
    "full_length": 1929
  },
  "Stay": {
    "file": "Stay _ Reforge.docx",
    "text": "Corporate pension plans for B2Bs to offer their employees Tiffany is on the founding team Former Product Lead at ‘Novo’ Messagebird (Whatsapp) Product Board Slack Interview interest Have a lot of users B2B2C company Interviews with the C Price",
    "full_length": 243
  },
  "Constant Contact _ Reforge Insights Use Case Overv.docx": {
    "file": "Constant Contact _ Reforge Insights Use Case Overv.docx",
    "text": "Constant Contact / Reforge Insights Objective Establish Constant Contact's systematic Voice of Customer program by consolidating fragmented feedback sources across sales, support, user research, and external review sites into a unified AI-powered platform that delivers real-time customer insights directly to product teams. This deployment will eliminate the current manual synthesis bottlenecks that leave the product organization operating without customer input, while providing self-serve access to personalized feedback streams that integrate seamlessly into existing product development workflows, ultimately enabling data-driven decision making at the speed required for Q4 planning and beyond. Current Challenges (As We Heard Them) No formal VOC Program  - there's no actual customer insights/feedback program in place Fragmented Data Sources -  Multiple disconnected systems, including Gong, Five9, Verint, Salesforce, Zoom, Google Meet, Surveys, Review Sites with no centralized integration. Product Team Lacks Customer Input -  Product team currently doesn’t integrate customer feedback into the core product process. Research Synthesis Takes Long Time -  Research is being synthesized, but takes a lot of manual work and really long time. No Self-Serve Capabilities for Product -  No ability for product team to self serve understanding of customer feedback. Traditional (But Outdated) Approach Historically, teams tried to solve this with: Manual feedback aggregation Static repositories Manual linking individual feedback directly to roadmap items Problem:  This model breaks at scale — it becomes too high friction, unsustainable, inconsistent, and slows things down vs speeding things up. Goals + Outcomes 0 to 90 Days (Foundations, Q4 Planning, Initial Habit) Unify the customer voice Do:  Connect Gong, Five9/Verint, Salesforce, Zoom/Meet, surveys, and review sites; ingest historical data and enable daily sync. Outcome:  One searchable, ARR‑aware index of customer feedback powering product decisions; no more hunting across tools. Eliminate manual synthesis Do:  Automated theming, ARR‑weighted impact, sentiment, and trend detection. Train team on use of Insights chat. Outcome:  Time to answer top customer questions drops from months → minutes; 0 manual synthesis decks required. Equip Q4 planning with evidence Do:  Insights ready for Q4 planning. Exec ready dashboards. Outcome:  100% of Q4 briefs/goals include customer evidence tied to the problem Personalize Insights views by ownership Do:  Stand up “Feedback Rivers” (Slack/email) per PM/team with anomalies and new themes for their areas. Outcome:  100% of PMs subscribed and viewing weekly; each team sees a feed of customer feedback where they work. Build the weekly habit Do:  Train teams; add an “Insights check” to PRD/review rituals; create lightweight governance (“no PRD without evidence”). Outcome:   ≥80%  of PMs active weekly in Insights;  2  exec reviews/month reference Insights data. Second 90 Days (Sca",
    "full_length": 9673
  },
  "Hippo": {
    "file": "Hippo _ Reforge.docx",
    "text": "Just signed up for about 30 seats Product / Marketing Challenges Time to recruit interviews Build something based on those Customer Feedback CS - Salesforce Tools to send out survey Analytics platform that powers everything behind the scenes Quantitative insights Anecdotes from service/sales team User Testing Get some customer Telephony - voice recording / chat Solution for Insights / Launch Positioning He wants a UX research assistant Don’t want to have to hire a researcher PM’s — should be talking to people and getting feedback Great to set up interviews, really the delivery and the ‘who’ matters most Customers by segments - who they have defined People who viewed insurance websites Have seen Lemonaid Etc In the past Lot of time cost That admin cost sucks Periodically use User Testing Use it ad hoc Because its proactive - engage with the tool vs. running in the background Not part of day to day muscle VP of Product Much more customer centric Customer interviews - implementing processes from the past Amplitude now - were using Heap UX platform for heat maps Customer behavior Analysis Experimentation platform Use Qualtrics - output survey Ai more summary based Can go and summarize results of survey and provide recommendation Ideal world Recruiting Scheduling Interviewing Feeding into building Recommend this based on what we saw Test again Interview again Get it over to amploitdue",
    "full_length": 1402
  },
  "VoiceMod": {
    "file": "VoiceMod _ Reforge.docx",
    "text": "Answers  1. Brand Personalization and User Experience Currently, the AI interviewer feels quite generic. It would be highly valuable to be able to  customize the interface and persona  to better align with our brand and user experience expectations. Example improvements: allowing us to  add a branded avatar , select tone or personality presets, and modify introduction messages. We could have customization of the avatar (the 3 colors easily, but a bit limited in options outside of that). There is probably more general page theming we could support in the future if the desire is to use our hosted interviewer page vs embedding in the widget. Introduction messages are also something we could have better support of. With 11labs even there is a way to set the \"First message\" vs having it generate the first message dynamically based on the interview goals. Personalization of the agent is something I wouldn't want to invest into much in the short term. I think this fits more into our eventual agent we're planning to build which should give us more control over this aspect of the agent. This would help users perceive it as a genuine Voicemod interaction rather than an external tool, increasing engagement and trust.   2. Translation and Localization Translations are still inconsistent and not fully natural in some languages. What languages were they having trouble with? Any specifics about the user's localization and chosen language would be great. We have added better handling for Spanish(in Spain) for example.   3. User Identification and Screening Limitations One of the biggest limitations for us is the  lack of user metadata and screening options . We currently launch the in-app notification to a specific segment (e.g., users who created at least one voice in Voicelab), but once they land on the Reforge tool, we  lose all segmentation context . This might be something we already could support through our \"Identity\" endpoint where they can pass more of this metadata which we would then map to via the email address entered. We don’t have access to basic information like  country, age, main use case, or app version , which are essential for contextualizing responses. If they don't want to pass this, it would be pretty quick to pass an identifier through URL param or widget initialization action Ideally, there should be a way to  pass metadata or identifiers  from our app to the Reforge session (e.g., via parameters or API integration) so that responses can be analyzed by user segment.  4. Data Export and Sharing Pain Points The inability to  download audio clips or complete interviews (audio + transcript)  is a major blocker for stakeholder sharing and analysis. Our reporting process relies on  embedding audio/video snippets  and showing both the  question and answer  for context. This has been an open question and haven't been given a specific product decision on if we should support it yet. Allowing the user to download the full interview audio would be",
    "full_length": 8193
  },
  "Ecovadis": {
    "file": "Ecovadis _ Reforge.docx",
    "text": "Tab 1 Context Wanting to try AI prototyping tools Tested Replit Replit is quite expensive Prototyping Process Designers have Figma In general: Discovery Prod Manager works with designer to put a first iteration of what new feature could be Improve the design, then ship the feature Victoire Product side - not a PM - working more on the strategy - one step before PM Simplistic view of what happens Customer Voice They identify opportunities for new products New trends they want to explore with customers Lots of interviews, understand the problem - more high level view Generally its for new products Understanding the pain point Product Team size Designers and PMs 50 people Pilot 50 people testing Process with Replit People were trying it out individually / small team – specific project Then - 2 series of workshops - tried it on side, used Replit for 2 workshops Replit training? Teams of 4-5 people using Replit for specific projects together in a room - providing feedback Team leaders Pricing First reaction of the team leader who was not expecting that price $55,000 for the year - linked to budget they put together VIC TWAHH – pronounce her name Tab 2 Product Team size Designers and PMs 50 people Customer Voice They identify opportunities for new products New trends they want to explore with customers Lots of interviews, understand the problem - more high level view Generally its for new products Understanding the pain point Process Discovery Prod Manager works with designer to put a first iteration of what new feature could be Improve the design, then ship the feature Replit: $55,000 for the year - linked to budget they put together Reforge: $30,000 50 users x 10k credits each Anna Bianchi - Product Strategy Manager Jo Wightman -  Tested Replit Victoire has shared the outcome Teams were very excited about it Useful tool - discovery phase Haven’t signed anything yet Would like to test other tools - including Reforge Build QUESTIONS Where can you pull them from One major tool they use ProductBoard - gather insights there How does it differ Different sources - tickets, emails, ad hoc feedback, surveys - can’t directly upload the survey - user needs  Prototyping piece Where does it start from Interviews How does it work Process Trial - what makes it possible to test before buying it Could share with them a proposal, length - users - all features included Day we launch the trial - training with me, show them how to use it Commercial proposal from our end Timing Not rushed to buy anything Initiate the trial ASAP - sooner the better Scope Bring efficiency to the team Replit - 1 month Slack? Different team collating insights Next Steps Check with product team on trial play Send followup email on Monday Quote For roughly 1.5× what you pay for Learning today, your entire team can learn, prototype, test, and analyze, without stitching together five tools or worrying about usage until you’re truly scaling. We’re offering this as early partner bundle pricing, and",
    "full_length": 5248
  },
  "Prospecting": {
    "file": "Prospecting _ Reforge.docx",
    "text": "Closest to pin: Deals in play Zeffy | $25k Insights Pricing Page views",
    "full_length": 70
  },
  "Integrait": {
    "file": "Integrait _ Reforge.docx",
    "text": "Centric - C Corp Integrait - Services company Feedback volume Very ad hoc Mixing things from calls, forms, Slack into a ad hoc list that they prioritize They have their own system to extract snippets from a conversation Conversations > lists Manual process For Slack > integrated to google spreadsheets -  feedback.ai  - like insights but with less features Feedback.ai Score them against each other Labels Prompt to classify Scoring is not super reliable Want to professionalize this - close the insights  September is key month - 1200 items this month 20% user growth this month Engrain feedback collection and reaction on the build process One company does something similar - Magic Patterns Worst vibe coding tool - doesnt have integrations or backend Insights - data  Next: Set up trial of Insights for Jorge",
    "full_length": 813
  },
  "4Mativ": {
    "file": "4Mativ _ Reforge.docx",
    "text": "Tab 1 What: Reforge build is built for product discovery, not just the artifact of a prototype 4Mativ School transportation company Smart route optimization Real time comms Person Discovery Who are they? What is their function/role? Company Discovery What’s the company? Prototyping Discovery Where are they on their prototyping journey? A couple people using? Whole team using? New? What problems have they been trying to solve with prototyping and why? What other tools have they tried? What they like and issues they’ve ran into? Evaluation Discovery Where are they at in their product evaluation journey? If active, the core criteria they are looking for? The steps? How will they make a decision? What is this person’s role in evaluating prototyping for their company? Demo Extension capture (start from your product) Company context Plan Mode Variants Sharing/commenting (coming soon) interview/survey integration",
    "full_length": 919
  },
  "Kafene": {
    "file": "Kafene _ Reforge.docx",
    "text": "Mike Schuler - Senior PM Familiar with Reforge for years Pivot to B2b noticed Kafene - Lease to Own for furniture, electronics, etc Trigger: Inbound demo request for Research His team Try to do 4 interviews a week Just their customer segment B2B2C firm What ends up happening - high no show rate Lucky to get 1 a week right now - in a month maybe getting 2 Product interviews Also run something when a lease gets signed Calls: Telephony system - Five Nine - bit antiquated Also email sent out with survey - they’ll check in throughout lifetime of lease When they hang up with servicing agent - text to a survey as well Lots of disgruntled customers - people think they signed up for something they didnt Is there a way to limit the hard cap",
    "full_length": 740
  },
  "Enel": {
    "file": "Enel _ Reforge.docx",
    "text": "Notes “Numbers only tell part of the story” “Hybrid approach” – a methodology that complements - not replaces - trad qualitative research What are all sources? How much volume? —-------------------------------------------------- Mind the Bridge Innovation consultancy ENEL - big utility from Italy Biggest in world when it comes to distribution $82million ARR / year They are tech partners to scout corporate needs Responsible for the west coast of US - and some other territories - main focus is Silicon Valley This one ENELs customer lab Global Innovation dept of the company Context ENEL - drives customer centric research across multiple market Italy and others Supports Product Marketing and UX teams for product experience Historically - 2 directions Qual methods - focus groups, in depth interviews Quant surveys - gives them scale - statistical data they need - miss the emotional nuance between the numbers Challenge Addressing these gaps Scouting - want to bridge that - qual at scale methodology - tools that combine interpretative power Scalability of quantitative analytics Being able to process thousands of surveys, transcripts, live feedback Same time - keep researchers in the loop - don’t want to lose this human interaction there Not replacing researchers - complementing them - democratize insights across business units - lower costs Enels customer lab - qual and quant workflows Use agencies depending on project type No integrated environment for them Thats why they launched this Proof of concept / real use cases Automation/Multi-lingual support/Human in loop / Speed THEMES they are interested in MAIN CHALLENGE Bridge between qual / quant Lower cost - make it more automated Pretty manual Cost and time Volume Talking about on the biggest extreme Salesforce Tickets Calls Cloud based Requirements The solution MUST have (please insert the list of mandatory requirements – e.g. cost <XY, TRL> XY, be ready to be applicable on XY? Etc.) 1) High solution’s TRL (it must be a market-ready platform). 2) Surveys to analyse include both open and closed-ended questions collected via written text. 3) User-friendly and simple to use, intuitive dashboard for non-technical users. 4) Ability to process multilingual data (especially Italian, Spanish, English, Portuguese). 5) Automated coding of qualitative data at scale (analyse and categorise large volumes of unstructured, open-ended data—like survey responses, interview transcripts in any format, images—without manual intervention). 6) Ability to detect weak signals and emerging trends from the unstructured data analysed. 7) Representation of insights and trends derived from the data via visual charts, graphs, calculation of KPIs, and outlining possibly relevant quotes from surveyed people. 8) Human-in-the-loop options for validation and refinement after the outcome is turned by the platform to launch a new elaboration. 9) Cloud-based platform (e.g., Saas). The solution SHOULD have (e.g. the solution should be appli",
    "full_length": 13067
  },
  "Prospecting _ Reforge(1).docx": {
    "file": "Prospecting _ Reforge(1).docx",
    "text": "Strategy Network Warm leads Cross-Sell Pull list Find out why someone should be excluded Opted in the way they are opted in Exclusion list Network WorkBoard Litmos Boston Celtics Warm Leads Will Georges list Whale Raw List Plays Net New Warm / Cold Cross-Sell Land + Expand Cross-Sell EDU clients who’ve done product courses EDU clients coming up on renewal Themes Modern, innovative, high growth companies, PE backed, investing in AI to improve efficiency Cross-Sell —---------------------------------------------------------------------------------------------------------------------------- Anthropic Circle Clients Ada https://www.linkedin.com/sales/lead/ACwAABdRZSkBy0O5fV099MwYQ9hIxQFsIb77_fI,NAME_SEARCH,K-es?_ntb=ywKV1Zv7QZK7mQrynbFE0w%3D%3D Cycle story:  https://www.cycle.app/customers/ada Swan Clara Chaume https://www.cycle.app/customers/swan Strapi Fabriq Akeneo https://docs.google.com/document/d/1m4pNUoDTB6PcMJxCXN-YQN4ZIyGFKIVw4Yyo9WvN3KE/edit?tab=t.h766x3nuiohx Software - MidMarket Lists All free Insights signups  (non customers) Cycle Rips Product Hunt Claude Thread Demo Interviewer Participants —---------------------------------------------------------------------------------------------------------------------------- Targets Whales GoHighLevel Starbucks Cyle Rips Product Hunt Interviewer 50 Target Accounts Ranked by User Database Size & Customer Feedback Volume Analysis based on publicly available data and industry benchmarks 🔢 Ranked by User Database Size Rank Company User Base Feedback Volume Industry Priority Tier 1 Condé Nast 350M Very High Media & Publishing Tier 1 2 BuzzFeed 300M Very High Media & Publishing Tier 1 3 Vice Media 250M High Media & Publishing Tier 1 4 Airbnb 200M Extreme Existing Client Reference 5 Uber 180M Extreme Existing Client Reference 6 USA Today 165M High Media & Publishing Tier 1 7 The Guardian 150M High Media & Publishing Tier 1 8 Bloomberg Media 120M High Media & Publishing Tier 1 9 Washington Post 100M High Media & Publishing Tier 1 10 Vox Media 100M High Media & Publishing Tier 1 11 Poshmark 80M Very High Marketplace Tier 3 12 Wall Street Journal 50M High Media & Publishing Tier 1 13 DHL Express 50M Very High Logistics Tier 2 14 Care.com 35M Very High Marketplace Tier 3 15 Instacart 30M Extreme Marketplace Tier 3 16 DoorDash 30M Extreme Marketplace Tier 3 17 FedEx 30M Very High Logistics Tier 2 18 Angi Services 20M Very High Marketplace Tier 3 19 Upwork 18M Very High Marketplace Tier 3 20 Grubhub 15M Very High Marketplace Tier 3 21 Shopify 10M Very High B2B SaaS Tier 4 22 Stripe 8M High B2B SaaS Tier 4 23 Zendesk 6M Very High B2B SaaS Tier 4 24 TaskRabbit 5M Very High Marketplace Tier 3 25 Toast 5M High Existing Client Reference 📢 Ranked by Customer Feedback Volume Rank Company Feedback Volume User Base Industry Win Rate Expectation 1 Instacart Extreme 30M Marketplace 50% (High Volume) 2 DoorDash Extreme 30M Marketplace 50% (High Volume) 3 Airbnb Extreme 200M Existing Client Proven Success 4 Uber Extreme 18",
    "full_length": 12161
  }
}